zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/pio/sam4ls2c.h
#define PINMUX_PC08B_USART2_CLK    ((PIN_PC08B_USART2_CLK << 16) | MUX_PC08B_USART2_CLK)
#define GPIO_PC08B_USART2_CLK    _UL(1 <<  8)
#define PIN_PA18A_USART2_CLK           _L(18) /**< \brief USART2 signal: CLK on PA18 mux A */
#define MUX_PA18A_USART2_CLK            _L(0)
#define PINMUX_PA18A_USART2_CLK    ((PIN_PA18A_USART2_CLK << 16) | MUX_PA18A_USART2_CLK)
#define GPIO_PA18A_USART2_CLK    _UL(1 << 18)
#define PIN_PC08E_USART2_CTS           _L(72) /**< \brief USART2 signal: CTS on PC08 mux E */
#define MUX_PC08E_USART2_CTS            _L(4)
#define PINMUX_PC08E_USART2_CTS    ((PIN_PC08E_USART2_CTS << 16) | MUX_PC08E_USART2_CTS)
#define GPIO_PC08E_USART2_CTS    _UL(1 <<  8)
#define PIN_PA22B_USART2_CTS           _L(22) /**< \brief USART2 signal: CTS on PA22 mux B */
#define MUX_PA22B_USART2_CTS            _L(1)
#define PINMUX_PA22B_USART2_CTS    ((PIN_PA22B_USART2_CTS << 16) | MUX_PA22B_USART2_CTS)
#define GPIO_PA22B_USART2_CTS    _UL(1 << 22)
#define PIN_PC07B_USART2_RTS           _L(71) /**< \brief USART2 signal: RTS on PC07 mux B */
#define MUX_PC07B_USART2_RTS            _L(1)
#define PINMUX_PC07B_USART2_RTS    ((PIN_PC07B_USART2_RTS << 16) | MUX_PC07B_USART2_RTS)
#define GPIO_PC07B_USART2_RTS    _UL(1 <<  7)
#define PIN_PA17A_USART2_RTS           _L(17) /**< \brief USART2 signal: RTS on PA17 mux A */
#define MUX_PA17A_USART2_RTS            _L(0)
#define PINMUX_PA17A_USART2_RTS    ((PIN_PA17A_USART2_RTS << 16) | MUX_PA17A_USART2_RTS)
#define GPIO_PA17A_USART2_RTS    _UL(1 << 17)
#define PIN_PA25B_USART2_RXD           _L(25) /**< \brief USART2 signal: RXD on PA25 mux B */
#define MUX_PA25B_USART2_RXD            _L(1)
#define PINMUX_PA25B_USART2_RXD    ((PIN_PA25B_USART2_RXD << 16) | MUX_PA25B_USART2_RXD)
#define GPIO_PA25B_USART2_RXD    _UL(1 << 25)
#define PIN_PC11B_USART2_RXD           _L(75) /**< \brief USART2 signal: RXD on PC11 mux B */
#define MUX_PC11B_USART2_RXD            _L(1)
#define PINMUX_PC11B_USART2_RXD    ((PIN_PC11B_USART2_RXD << 16) | MUX_PC11B_USART2_RXD)
#define GPIO_PC11B_USART2_RXD    _UL(1 << 11)
#define PIN_PA19A_USART2_RXD           _L(19) /**< \brief USART2 signal: RXD on PA19 mux A */
#define MUX_PA19A_USART2_RXD            _L(0)
#define PINMUX_PA19A_USART2_RXD    ((PIN_PA19A_USART2_RXD << 16) | MUX_PA19A_USART2_RXD)
#define GPIO_PA19A_USART2_RXD    _UL(1 << 19)
#define PIN_PA26B_USART2_TXD           _L(26) /**< \brief USART2 signal: TXD on PA26 mux B */
#define MUX_PA26B_USART2_TXD            _L(1)
#define PINMUX_PA26B_USART2_TXD    ((PIN_PA26B_USART2_TXD << 16) | MUX_PA26B_USART2_TXD)
#define GPIO_PA26B_USART2_TXD    _UL(1 << 26)
#define PIN_PC12B_USART2_TXD           _L(76) /**< \brief USART2 signal: TXD on PC12 mux B */
#define MUX_PC12B_USART2_TXD            _L(1)
#define PINMUX_PC12B_USART2_TXD    ((PIN_PC12B_USART2_TXD << 16) | MUX_PC12B_USART2_TXD)
#define GPIO_PC12B_USART2_TXD    _UL(1 << 12)
#define PIN_PA20A_USART2_TXD           _L(20) /**< \brief USART2 signal: TXD on PA20 mux A */
#define MUX_PA20A_USART2_TXD            _L(0)
#define PINMUX_PA20A_USART2_TXD    ((PIN_PA20A_USART2_TXD << 16) | MUX_PA20A_USART2_TXD)
#define GPIO_PA20A_USART2_TXD    _UL(1 << 20)
/* ========== GPIO definition for USART3 peripheral ========== */
#define PIN_PA29E_USART3_CLK           _L(29) /**< \brief USART3 signal: CLK on PA29 mux E */
#define MUX_PA29E_USART3_CLK            _L(4)
#define PINMUX_PA29E_USART3_CLK    ((PIN_PA29E_USART3_CLK << 16) | MUX_PA29E_USART3_CLK)
#define GPIO_PA29E_USART3_CLK    _UL(1 << 29)
#define PIN_PC14B_USART3_CLK           _L(78) /**< \brief USART3 signal: CLK on PC14 mux B */
#define MUX_PC14B_USART3_CLK            _L(1)
#define PINMUX_PC14B_USART3_CLK    ((PIN_PC14B_USART3_CLK << 16) | MUX_PC14B_USART3_CLK)
#define GPIO_PC14B_USART3_CLK    _UL(1 << 14)
#define PIN_PB08A_USART3_CLK           _L(40) /**< \brief USART3 signal: CLK on PB08 mux A */
#define MUX_PB08A_USART3_CLK            _L(0)
#define PINMUX_PB08A_USART3_CLK    ((PIN_PB08A_USART3_CLK << 16) | MUX_PB08A_USART3_CLK)
#define GPIO_PB08A_USART3_CLK    _UL(1 <<  8)
#define PIN_PC31A_USART3_CLK           _L(95) /**< \brief USART3 signal: CLK on PC31 mux A */
#define MUX_PC31A_USART3_CLK            _L(0)
#define PINMUX_PC31A_USART3_CLK    ((PIN_PC31A_USART3_CLK << 16) | MUX_PC31A_USART3_CLK)
#define GPIO_PC31A_USART3_CLK    _UL(1 << 31)
#define PIN_PA28E_USART3_CTS           _L(28) /**< \brief USART3 signal: CTS on PA28 mux E */
#define MUX_PA28E_USART3_CTS            _L(4)
#define PINMUX_PA28E_USART3_CTS    ((PIN_PA28E_USART3_CTS << 16) | MUX_PA28E_USART3_CTS)
#define GPIO_PA28E_USART3_CTS    _UL(1 << 28)
#define PIN_PB07A_USART3_CTS           _L(39) /**< \brief USART3 signal: CTS on PB07 mux A */
#define MUX_PB07A_USART3_CTS            _L(0)
#define PINMUX_PB07A_USART3_CTS    ((PIN_PB07A_USART3_CTS << 16) | MUX_PB07A_USART3_CTS)
#define GPIO_PB07A_USART3_CTS    _UL(1 <<  7)
#define PIN_PA27E_USART3_RTS           _L(27) /**< \brief USART3 signal: RTS on PA27 mux E */
#define MUX_PA27E_USART3_RTS            _L(4)
#define PINMUX_PA27E_USART3_RTS    ((PIN_PA27E_USART3_RTS << 16) | MUX_PA27E_USART3_RTS)
#define GPIO_PA27E_USART3_RTS    _UL(1 << 27)
#define PIN_PC13B_USART3_RTS           _L(77) /**< \brief USART3 signal: RTS on PC13 mux B */
#define MUX_PC13B_USART3_RTS            _L(1)
#define PINMUX_PC13B_USART3_RTS    ((PIN_PC13B_USART3_RTS << 16) | MUX_PC13B_USART3_RTS)
#define GPIO_PC13B_USART3_RTS    _UL(1 << 13)
#define PIN_PB06A_USART3_RTS           _L(38) /**< \brief USART3 signal: RTS on PB06 mux A */
#define MUX_PB06A_USART3_RTS            _L(0)
#define PINMUX_PB06A_USART3_RTS    ((PIN_PB06A_USART3_RTS << 16) | MUX_PB06A_USART3_RTS)
#define GPIO_PB06A_USART3_RTS    _UL(1 <<  6)
#define PIN_PC30A_USART3_RTS           _L(94) /**< \brief USART3 signal: RTS on PC30 mux A */
#define MUX_PC30A_USART3_RTS            _L(0)
#define PINMUX_PC30A_USART3_RTS    ((PIN_PC30A_USART3_RTS << 16) | MUX_PC30A_USART3_RTS)
#define GPIO_PC30A_USART3_RTS    _UL(1 << 30)
#define PIN_PA30E_USART3_RXD           _L(30) /**< \brief USART3 signal: RXD on PA30 mux E */
#define MUX_PA30E_USART3_RXD            _L(4)
#define PINMUX_PA30E_USART3_RXD    ((PIN_PA30E_USART3_RXD << 16) | MUX_PA30E_USART3_RXD)
#define GPIO_PA30E_USART3_RXD    _UL(1 << 30)
#define PIN_PC09B_USART3_RXD           _L(73) /**< \brief USART3 signal: RXD on PC09 mux B */
#define MUX_PC09B_USART3_RXD            _L(1)
#define PINMUX_PC09B_USART3_RXD    ((PIN_PC09B_USART3_RXD << 16) | MUX_PC09B_USART3_RXD)
#define GPIO_PC09B_USART3_RXD    _UL(1 <<  9)
#define PIN_PB09A_USART3_RXD           _L(41) /**< \brief USART3 signal: RXD on PB09 mux A */
#define MUX_PB09A_USART3_RXD            _L(0)
#define PINMUX_PB09A_USART3_RXD    ((PIN_PB09A_USART3_RXD << 16) | MUX_PB09A_USART3_RXD)
#define GPIO_PB09A_USART3_RXD    _UL(1 <<  9)
#define PIN_PC28A_USART3_RXD           _L(92) /**< \brief USART3 signal: RXD on PC28 mux A */
#define MUX_PC28A_USART3_RXD            _L(0)
#define PINMUX_PC28A_USART3_RXD    ((PIN_PC28A_USART3_RXD << 16) | MUX_PC28A_USART3_RXD)
#define GPIO_PC28A_USART3_RXD    _UL(1 << 28)
#define PIN_PA31E_USART3_TXD           _L(31) /**< \brief USART3 signal: TXD on PA31 mux E */
#define MUX_PA31E_USART3_TXD            _L(4)
#define PINMUX_PA31E_USART3_TXD    ((PIN_PA31E_USART3_TXD << 16) | MUX_PA31E_USART3_TXD)
#define GPIO_PA31E_USART3_TXD    _UL(1 << 31)
#define PIN_PC10B_USART3_TXD           _L(74) /**< \brief USART3 signal: TXD on PC10 mux B */
#define MUX_PC10B_USART3_TXD            _L(1)
#define PINMUX_PC10B_USART3_TXD    ((PIN_PC10B_USART3_TXD << 16) | MUX_PC10B_USART3_TXD)
#define GPIO_PC10B_USART3_TXD    _UL(1 << 10)
#define PIN_PB10A_USART3_TXD           _L(42) /**< \brief USART3 signal: TXD on PB10 mux A */
#define MUX_PB10A_USART3_TXD            _L(0)
#define PINMUX_PB10A_USART3_TXD    ((PIN_PB10A_USART3_TXD << 16) | MUX_PB10A_USART3_TXD)
#define GPIO_PB10A_USART3_TXD    _UL(1 << 10)
#define PIN_PC29A_USART3_TXD           _L(93) /**< \brief USART3 signal: TXD on PC29 mux A */
#define MUX_PC29A_USART3_TXD            _L(0)
#define PINMUX_PC29A_USART3_TXD    ((PIN_PC29A_USART3_TXD << 16) | MUX_PC29A_USART3_TXD)
#define GPIO_PC29A_USART3_TXD    _UL(1 << 29)
/* ========== GPIO definition for ADCIFE peripheral ========== */
#define PIN_PA04A_ADCIFE_AD0            _L(4) /**< \brief ADCIFE signal: AD0 on PA04 mux A */
#define MUX_PA04A_ADCIFE_AD0            _L(0)
#define PINMUX_PA04A_ADCIFE_AD0    ((PIN_PA04A_ADCIFE_AD0 << 16) | MUX_PA04A_ADCIFE_AD0)
#define GPIO_PA04A_ADCIFE_AD0    _UL(1 <<  4)
#define PIN_PA05A_ADCIFE_AD1            _L(5) /**< \brief ADCIFE signal: AD1 on PA05 mux A */
#define MUX_PA05A_ADCIFE_AD1            _L(0)
#define PINMUX_PA05A_ADCIFE_AD1    ((PIN_PA05A_ADCIFE_AD1 << 16) | MUX_PA05A_ADCIFE_AD1)
#define GPIO_PA05A_ADCIFE_AD1    _UL(1 <<  5)
#define PIN_PA07A_ADCIFE_AD2            _L(7) /**< \brief ADCIFE signal: AD2 on PA07 mux A */
#define MUX_PA07A_ADCIFE_AD2            _L(0)
#define PINMUX_PA07A_ADCIFE_AD2    ((PIN_PA07A_ADCIFE_AD2 << 16) | MUX_PA07A_ADCIFE_AD2)
#define GPIO_PA07A_ADCIFE_AD2    _UL(1 <<  7)
#define PIN_PB02A_ADCIFE_AD3           _L(34) /**< \brief ADCIFE signal: AD3 on PB02 mux A */
#define MUX_PB02A_ADCIFE_AD3            _L(0)
#define PINMUX_PB02A_ADCIFE_AD3    ((PIN_PB02A_ADCIFE_AD3 << 16) | MUX_PB02A_ADCIFE_AD3)
#define GPIO_PB02A_ADCIFE_AD3    _UL(1 <<  2)
#define PIN_PB03A_ADCIFE_AD4           _L(35) /**< \brief ADCIFE signal: AD4 on PB03 mux A */
#define MUX_PB03A_ADCIFE_AD4            _L(0)
#define PINMUX_PB03A_ADCIFE_AD4    ((PIN_PB03A_ADCIFE_AD4 << 16) | MUX_PB03A_ADCIFE_AD4)
#define GPIO_PB03A_ADCIFE_AD4    _UL(1 <<  3)
#define PIN_PB04A_ADCIFE_AD5           _L(36) /**< \brief ADCIFE signal: AD5 on PB04 mux A */
#define MUX_PB04A_ADCIFE_AD5            _L(0)
#define PINMUX_PB04A_ADCIFE_AD5    ((PIN_PB04A_ADCIFE_AD5 << 16) | MUX_PB04A_ADCIFE_AD5)
#define GPIO_PB04A_ADCIFE_AD5    _UL(1 <<  4)
#define PIN_PB05A_ADCIFE_AD6           _L(37) /**< \brief ADCIFE signal: AD6 on PB05 mux A */
#define MUX_PB05A_ADCIFE_AD6            _L(0)
#define PINMUX_PB05A_ADCIFE_AD6    ((PIN_PB05A_ADCIFE_AD6 << 16) | MUX_PB05A_ADCIFE_AD6)
#define GPIO_PB05A_ADCIFE_AD6    _UL(1 <<  5)
#define PIN_PC07A_ADCIFE_AD7           _L(71) /**< \brief ADCIFE signal: AD7 on PC07 mux A */
#define MUX_PC07A_ADCIFE_AD7            _L(0)
#define PINMUX_PC07A_ADCIFE_AD7    ((PIN_PC07A_ADCIFE_AD7 << 16) | MUX_PC07A_ADCIFE_AD7)
#define GPIO_PC07A_ADCIFE_AD7    _UL(1 <<  7)
#define PIN_PC08A_ADCIFE_AD8           _L(72) /**< \brief ADCIFE signal: AD8 on PC08 mux A */
#define MUX_PC08A_ADCIFE_AD8            _L(0)
#define PINMUX_PC08A_ADCIFE_AD8    ((PIN_PC08A_ADCIFE_AD8 << 16) | MUX_PC08A_ADCIFE_AD8)
#define GPIO_PC08A_ADCIFE_AD8    _UL(1 <<  8)
#define PIN_PC09A_ADCIFE_AD9           _L(73) /**< \brief ADCIFE signal: AD9 on PC09 mux A */
#define MUX_PC09A_ADCIFE_AD9            _L(0)
#define PINMUX_PC09A_ADCIFE_AD9    ((PIN_PC09A_ADCIFE_AD9 << 16) | MUX_PC09A_ADCIFE_AD9)
#define GPIO_PC09A_ADCIFE_AD9    _UL(1 <<  9)
#define PIN_PC10A_ADCIFE_AD10          _L(74) /**< \brief ADCIFE signal: AD10 on PC10 mux A */
#define MUX_PC10A_ADCIFE_AD10           _L(0)
#define PINMUX_PC10A_ADCIFE_AD10   ((PIN_PC10A_ADCIFE_AD10 << 16) | MUX_PC10A_ADCIFE_AD10)
#define GPIO_PC10A_ADCIFE_AD10   _UL(1 << 10)
#define PIN_PC11A_ADCIFE_AD11          _L(75) /**< \brief ADCIFE signal: AD11 on PC11 mux A */
#define MUX_PC11A_ADCIFE_AD11           _L(0)
#define PINMUX_PC11A_ADCIFE_AD11   ((PIN_PC11A_ADCIFE_AD11 << 16) | MUX_PC11A_ADCIFE_AD11)
#define GPIO_PC11A_ADCIFE_AD11   _UL(1 << 11)
#define PIN_PC12A_ADCIFE_AD12          _L(76) /**< \brief ADCIFE signal: AD12 on PC12 mux A */
#define MUX_PC12A_ADCIFE_AD12           _L(0)
#define PINMUX_PC12A_ADCIFE_AD12   ((PIN_PC12A_ADCIFE_AD12 << 16) | MUX_PC12A_ADCIFE_AD12)
#define GPIO_PC12A_ADCIFE_AD12   _UL(1 << 12)
#define PIN_PC13A_ADCIFE_AD13          _L(77) /**< \brief ADCIFE signal: AD13 on PC13 mux A */
#define MUX_PC13A_ADCIFE_AD13           _L(0)
#define PINMUX_PC13A_ADCIFE_AD13   ((PIN_PC13A_ADCIFE_AD13 << 16) | MUX_PC13A_ADCIFE_AD13)
#define GPIO_PC13A_ADCIFE_AD13   _UL(1 << 13)
#define PIN_PC14A_ADCIFE_AD14          _L(78) /**< \brief ADCIFE signal: AD14 on PC14 mux A */
#define MUX_PC14A_ADCIFE_AD14           _L(0)
#define PINMUX_PC14A_ADCIFE_AD14   ((PIN_PC14A_ADCIFE_AD14 << 16) | MUX_PC14A_ADCIFE_AD14)
#define GPIO_PC14A_ADCIFE_AD14   _UL(1 << 14)
#define PIN_PA05E_ADCIFE_TRIGGER        _L(5) /**< \brief ADCIFE signal: TRIGGER on PA05 mux E */
#define MUX_PA05E_ADCIFE_TRIGGER        _L(4)
#define PINMUX_PA05E_ADCIFE_TRIGGER  ((PIN_PA05E_ADCIFE_TRIGGER << 16) | MUX_PA05E_ADCIFE_TRIGGER)
#define GPIO_PA05E_ADCIFE_TRIGGER  _UL(1 <<  5)
/* ========== GPIO definition for DACC peripheral ========== */
#define PIN_PB04E_DACC_EXT_TRIG0       _L(36) /**< \brief DACC signal: EXT_TRIG0 on PB04 mux E */
#define MUX_PB04E_DACC_EXT_TRIG0        _L(4)
#define PINMUX_PB04E_DACC_EXT_TRIG0  ((PIN_PB04E_DACC_EXT_TRIG0 << 16) | MUX_PB04E_DACC_EXT_TRIG0)
#define GPIO_PB04E_DACC_EXT_TRIG0  _UL(1 <<  4)
#define PIN_PA06A_DACC_VOUT             _L(6) /**< \brief DACC signal: VOUT on PA06 mux A */
#define MUX_PA06A_DACC_VOUT             _L(0)
#define PINMUX_PA06A_DACC_VOUT     ((PIN_PA06A_DACC_VOUT << 16) | MUX_PA06A_DACC_VOUT)
#define GPIO_PA06A_DACC_VOUT     _UL(1 <<  6)
/* ========== GPIO definition for ACIFC peripheral ========== */
#define PIN_PA06E_ACIFC_ACAN0           _L(6) /**< \brief ACIFC signal: ACAN0 on PA06 mux E */
#define MUX_PA06E_ACIFC_ACAN0           _L(4)
#define PINMUX_PA06E_ACIFC_ACAN0   ((PIN_PA06E_ACIFC_ACAN0 << 16) | MUX_PA06E_ACIFC_ACAN0)
#define GPIO_PA06E_ACIFC_ACAN0   _UL(1 <<  6)
#define PIN_PC09E_ACIFC_ACAN1          _L(73) /**< \brief ACIFC signal: ACAN1 on PC09 mux E */
#define MUX_PC09E_ACIFC_ACAN1           _L(4)
#define PINMUX_PC09E_ACIFC_ACAN1   ((PIN_PC09E_ACIFC_ACAN1 << 16) | MUX_PC09E_ACIFC_ACAN1)
#define GPIO_PC09E_ACIFC_ACAN1   _UL(1 <<  9)
#define PIN_PA07E_ACIFC_ACAP0           _L(7) /**< \brief ACIFC signal: ACAP0 on PA07 mux E */
#define MUX_PA07E_ACIFC_ACAP0           _L(4)
#define PINMUX_PA07E_ACIFC_ACAP0   ((PIN_PA07E_ACIFC_ACAP0 << 16) | MUX_PA07E_ACIFC_ACAP0)
#define GPIO_PA07E_ACIFC_ACAP0   _UL(1 <<  7)
#define PIN_PC10E_ACIFC_ACAP1          _L(74) /**< \brief ACIFC signal: ACAP1 on PC10 mux E */
#define MUX_PC10E_ACIFC_ACAP1           _L(4)
#define PINMUX_PC10E_ACIFC_ACAP1   ((PIN_PC10E_ACIFC_ACAP1 << 16) | MUX_PC10E_ACIFC_ACAP1)
#define GPIO_PC10E_ACIFC_ACAP1   _UL(1 << 10)
#define PIN_PB02E_ACIFC_ACBN0          _L(34) /**< \brief ACIFC signal: ACBN0 on PB02 mux E */
#define MUX_PB02E_ACIFC_ACBN0           _L(4)
#define PINMUX_PB02E_ACIFC_ACBN0   ((PIN_PB02E_ACIFC_ACBN0 << 16) | MUX_PB02E_ACIFC_ACBN0)
#define GPIO_PB02E_ACIFC_ACBN0   _UL(1 <<  2)
#define PIN_PC13E_ACIFC_ACBN1          _L(77) /**< \brief ACIFC signal: ACBN1 on PC13 mux E */
#define MUX_PC13E_ACIFC_ACBN1           _L(4)
#define PINMUX_PC13E_ACIFC_ACBN1   ((PIN_PC13E_ACIFC_ACBN1 << 16) | MUX_PC13E_ACIFC_ACBN1)
#define GPIO_PC13E_ACIFC_ACBN1   _UL(1 << 13)
#define PIN_PB03E_ACIFC_ACBP0          _L(35) /**< \brief ACIFC signal: ACBP0 on PB03 mux E */
#define MUX_PB03E_ACIFC_ACBP0           _L(4)
#define PINMUX_PB03E_ACIFC_ACBP0   ((PIN_PB03E_ACIFC_ACBP0 << 16) | MUX_PB03E_ACIFC_ACBP0)
#define GPIO_PB03E_ACIFC_ACBP0   _UL(1 <<  3)
#define PIN_PC14E_ACIFC_ACBP1          _L(78) /**< \brief ACIFC signal: ACBP1 on PC14 mux E */
#define MUX_PC14E_ACIFC_ACBP1           _L(4)
#define PINMUX_PC14E_ACIFC_ACBP1   ((PIN_PC14E_ACIFC_ACBP1 << 16) | MUX_PC14E_ACIFC_ACBP1)
#define GPIO_PC14E_ACIFC_ACBP1   _UL(1 << 14)
/* ========== GPIO definition for GLOC peripheral ========== */
#define PIN_PA06D_GLOC_IN0              _L(6) /**< \brief GLOC signal: IN0 on PA06 mux D */
#define MUX_PA06D_GLOC_IN0              _L(3)
#define PINMUX_PA06D_GLOC_IN0      ((PIN_PA06D_GLOC_IN0 << 16) | MUX_PA06D_GLOC_IN0)
#define GPIO_PA06D_GLOC_IN0      _UL(1 <<  6)
#define PIN_PA20D_GLOC_IN0             _L(20) /**< \brief GLOC signal: IN0 on PA20 mux D */
#define MUX_PA20D_GLOC_IN0              _L(3)
#define PINMUX_PA20D_GLOC_IN0      ((PIN_PA20D_GLOC_IN0 << 16) | MUX_PA20D_GLOC_IN0)
#define GPIO_PA20D_GLOC_IN0      _UL(1 << 20)
#define PIN_PA04D_GLOC_IN1              _L(4) /**< \brief GLOC signal: IN1 on PA04 mux D */
#define MUX_PA04D_GLOC_IN1              _L(3)
#define PINMUX_PA04D_GLOC_IN1      ((PIN_PA04D_GLOC_IN1 << 16) | MUX_PA04D_GLOC_IN1)
#define GPIO_PA04D_GLOC_IN1      _UL(1 <<  4)
#define PIN_PA21D_GLOC_IN1             _L(21) /**< \brief GLOC signal: IN1 on PA21 mux D */
#define MUX_PA21D_GLOC_IN1              _L(3)
#define PINMUX_PA21D_GLOC_IN1      ((PIN_PA21D_GLOC_IN1 << 16) | MUX_PA21D_GLOC_IN1)
#define GPIO_PA21D_GLOC_IN1      _UL(1 << 21)
#define PIN_PA05D_GLOC_IN2              _L(5) /**< \brief GLOC signal: IN2 on PA05 mux D */
#define MUX_PA05D_GLOC_IN2              _L(3)
#define PINMUX_PA05D_GLOC_IN2      ((PIN_PA05D_GLOC_IN2 << 16) | MUX_PA05D_GLOC_IN2)
#define GPIO_PA05D_GLOC_IN2      _UL(1 <<  5)
#define PIN_PA22D_GLOC_IN2             _L(22) /**< \brief GLOC signal: IN2 on PA22 mux D */
#define MUX_PA22D_GLOC_IN2              _L(3)
#define PINMUX_PA22D_GLOC_IN2      ((PIN_PA22D_GLOC_IN2 << 16) | MUX_PA22D_GLOC_IN2)
#define GPIO_PA22D_GLOC_IN2      _UL(1 << 22)
#define PIN_PA07D_GLOC_IN3              _L(7) /**< \brief GLOC signal: IN3 on PA07 mux D */
#define MUX_PA07D_GLOC_IN3              _L(3)
#define PINMUX_PA07D_GLOC_IN3      ((PIN_PA07D_GLOC_IN3 << 16) | MUX_PA07D_GLOC_IN3)
#define GPIO_PA07D_GLOC_IN3      _UL(1 <<  7)
#define PIN_PA23D_GLOC_IN3             _L(23) /**< \brief GLOC signal: IN3 on PA23 mux D */
#define MUX_PA23D_GLOC_IN3              _L(3)
#define PINMUX_PA23D_GLOC_IN3      ((PIN_PA23D_GLOC_IN3 << 16) | MUX_PA23D_GLOC_IN3)
#define GPIO_PA23D_GLOC_IN3      _UL(1 << 23)
#define PIN_PA27D_GLOC_IN4             _L(27) /**< \brief GLOC signal: IN4 on PA27 mux D */
#define MUX_PA27D_GLOC_IN4              _L(3)
#define PINMUX_PA27D_GLOC_IN4      ((PIN_PA27D_GLOC_IN4 << 16) | MUX_PA27D_GLOC_IN4)
#define GPIO_PA27D_GLOC_IN4      _UL(1 << 27)
#define PIN_PC15D_GLOC_IN4             _L(79) /**< \brief GLOC signal: IN4 on PC15 mux D */
#define MUX_PC15D_GLOC_IN4              _L(3)
#define PINMUX_PC15D_GLOC_IN4      ((PIN_PC15D_GLOC_IN4 << 16) | MUX_PC15D_GLOC_IN4)
#define GPIO_PC15D_GLOC_IN4      _UL(1 << 15)
#define PIN_PB06C_GLOC_IN4             _L(38) /**< \brief GLOC signal: IN4 on PB06 mux C */
#define MUX_PB06C_GLOC_IN4              _L(2)
#define PINMUX_PB06C_GLOC_IN4      ((PIN_PB06C_GLOC_IN4 << 16) | MUX_PB06C_GLOC_IN4)
#define GPIO_PB06C_GLOC_IN4      _UL(1 <<  6)
#define PIN_PC28C_GLOC_IN4             _L(92) /**< \brief GLOC signal: IN4 on PC28 mux C */
#define MUX_PC28C_GLOC_IN4              _L(2)
#define PINMUX_PC28C_GLOC_IN4      ((PIN_PC28C_GLOC_IN4 << 16) | MUX_PC28C_GLOC_IN4)
#define GPIO_PC28C_GLOC_IN4      _UL(1 << 28)
#define PIN_PA28D_GLOC_IN5             _L(28) /**< \brief GLOC signal: IN5 on PA28 mux D */
#define MUX_PA28D_GLOC_IN5              _L(3)
#define PINMUX_PA28D_GLOC_IN5      ((PIN_PA28D_GLOC_IN5 << 16) | MUX_PA28D_GLOC_IN5)
#define GPIO_PA28D_GLOC_IN5      _UL(1 << 28)
#define PIN_PC16D_GLOC_IN5             _L(80) /**< \brief GLOC signal: IN5 on PC16 mux D */
#define MUX_PC16D_GLOC_IN5              _L(3)
#define PINMUX_PC16D_GLOC_IN5      ((PIN_PC16D_GLOC_IN5 << 16) | MUX_PC16D_GLOC_IN5)
#define GPIO_PC16D_GLOC_IN5      _UL(1 << 16)
#define PIN_PB07C_GLOC_IN5             _L(39) /**< \brief GLOC signal: IN5 on PB07 mux C */
#define MUX_PB07C_GLOC_IN5              _L(2)
#define PINMUX_PB07C_GLOC_IN5      ((PIN_PB07C_GLOC_IN5 << 16) | MUX_PB07C_GLOC_IN5)
#define GPIO_PB07C_GLOC_IN5      _UL(1 <<  7)
#define PIN_PC29C_GLOC_IN5             _L(93) /**< \brief GLOC signal: IN5 on PC29 mux C */
#define MUX_PC29C_GLOC_IN5              _L(2)
#define PINMUX_PC29C_GLOC_IN5      ((PIN_PC29C_GLOC_IN5 << 16) | MUX_PC29C_GLOC_IN5)
#define GPIO_PC29C_GLOC_IN5      _UL(1 << 29)
#define PIN_PA29D_GLOC_IN6             _L(29) /**< \brief GLOC signal: IN6 on PA29 mux D */
#define MUX_PA29D_GLOC_IN6              _L(3)
#define PINMUX_PA29D_GLOC_IN6      ((PIN_PA29D_GLOC_IN6 << 16) | MUX_PA29D_GLOC_IN6)
#define GPIO_PA29D_GLOC_IN6      _UL(1 << 29)
#define PIN_PC17D_GLOC_IN6             _L(81) /**< \brief GLOC signal: IN6 on PC17 mux D */
#define MUX_PC17D_GLOC_IN6              _L(3)
#define PINMUX_PC17D_GLOC_IN6      ((PIN_PC17D_GLOC_IN6 << 16) | MUX_PC17D_GLOC_IN6)
#define GPIO_PC17D_GLOC_IN6      _UL(1 << 17)
#define PIN_PB08C_GLOC_IN6             _L(40) /**< \brief GLOC signal: IN6 on PB08 mux C */
#define MUX_PB08C_GLOC_IN6              _L(2)
#define PINMUX_PB08C_GLOC_IN6      ((PIN_PB08C_GLOC_IN6 << 16) | MUX_PB08C_GLOC_IN6)
#define GPIO_PB08C_GLOC_IN6      _UL(1 <<  8)
#define PIN_PC30C_GLOC_IN6             _L(94) /**< \brief GLOC signal: IN6 on PC30 mux C */
#define MUX_PC30C_GLOC_IN6              _L(2)
#define PINMUX_PC30C_GLOC_IN6      ((PIN_PC30C_GLOC_IN6 << 16) | MUX_PC30C_GLOC_IN6)
#define GPIO_PC30C_GLOC_IN6      _UL(1 << 30)
#define PIN_PA30D_GLOC_IN7             _L(30) /**< \brief GLOC signal: IN7 on PA30 mux D */
#define MUX_PA30D_GLOC_IN7              _L(3)
#define PINMUX_PA30D_GLOC_IN7      ((PIN_PA30D_GLOC_IN7 << 16) | MUX_PA30D_GLOC_IN7)
#define GPIO_PA30D_GLOC_IN7      _UL(1 << 30)
#define PIN_PC18D_GLOC_IN7             _L(82) /**< \brief GLOC signal: IN7 on PC18 mux D */
#define MUX_PC18D_GLOC_IN7              _L(3)
#define PINMUX_PC18D_GLOC_IN7      ((PIN_PC18D_GLOC_IN7 << 16) | MUX_PC18D_GLOC_IN7)
#define GPIO_PC18D_GLOC_IN7      _UL(1 << 18)
#define PIN_PB09C_GLOC_IN7             _L(41) /**< \brief GLOC signal: IN7 on PB09 mux C */
#define MUX_PB09C_GLOC_IN7              _L(2)
#define PINMUX_PB09C_GLOC_IN7      ((PIN_PB09C_GLOC_IN7 << 16) | MUX_PB09C_GLOC_IN7)
#define GPIO_PB09C_GLOC_IN7      _UL(1 <<  9)
#define PIN_PA08D_GLOC_OUT0             _L(8) /**< \brief GLOC signal: OUT0 on PA08 mux D */
#define MUX_PA08D_GLOC_OUT0             _L(3)
#define PINMUX_PA08D_GLOC_OUT0     ((PIN_PA08D_GLOC_OUT0 << 16) | MUX_PA08D_GLOC_OUT0)
#define GPIO_PA08D_GLOC_OUT0     _UL(1 <<  8)
#define PIN_PA24D_GLOC_OUT0            _L(24) /**< \brief GLOC signal: OUT0 on PA24 mux D */
#define MUX_PA24D_GLOC_OUT0             _L(3)
#define PINMUX_PA24D_GLOC_OUT0     ((PIN_PA24D_GLOC_OUT0 << 16) | MUX_PA24D_GLOC_OUT0)
#define GPIO_PA24D_GLOC_OUT0     _UL(1 << 24)
#define PIN_PA31D_GLOC_OUT1            _L(31) /**< \brief GLOC signal: OUT1 on PA31 mux D */
#define MUX_PA31D_GLOC_OUT1             _L(3)
#define PINMUX_PA31D_GLOC_OUT1     ((PIN_PA31D_GLOC_OUT1 << 16) | MUX_PA31D_GLOC_OUT1)
#define GPIO_PA31D_GLOC_OUT1     _UL(1 << 31)
#define PIN_PC19D_GLOC_OUT1            _L(83) /**< \brief GLOC signal: OUT1 on PC19 mux D */
#define MUX_PC19D_GLOC_OUT1             _L(3)
#define PINMUX_PC19D_GLOC_OUT1     ((PIN_PC19D_GLOC_OUT1 << 16) | MUX_PC19D_GLOC_OUT1)
#define GPIO_PC19D_GLOC_OUT1     _UL(1 << 19)
#define PIN_PB10C_GLOC_OUT1            _L(42) /**< \brief GLOC signal: OUT1 on PB10 mux C */
#define MUX_PB10C_GLOC_OUT1             _L(2)
#define PINMUX_PB10C_GLOC_OUT1     ((PIN_PB10C_GLOC_OUT1 << 16) | MUX_PB10C_GLOC_OUT1)
#define GPIO_PB10C_GLOC_OUT1     _UL(1 << 10)
#define PIN_PC31C_GLOC_OUT1            _L(95) /**< \brief GLOC signal: OUT1 on PC31 mux C */
#define MUX_PC31C_GLOC_OUT1             _L(2)
#define PINMUX_PC31C_GLOC_OUT1     ((PIN_PC31C_GLOC_OUT1 << 16) | MUX_PC31C_GLOC_OUT1)
#define GPIO_PC31C_GLOC_OUT1     _UL(1 << 31)
/* ========== GPIO definition for ABDACB peripheral ========== */
#define PIN_PA31C_ABDACB_CLK           _L(31) /**< \brief ABDACB signal: CLK on PA31 mux C */
#define MUX_PA31C_ABDACB_CLK            _L(2)
#define PINMUX_PA31C_ABDACB_CLK    ((PIN_PA31C_ABDACB_CLK << 16) | MUX_PA31C_ABDACB_CLK)
#define GPIO_PA31C_ABDACB_CLK    _UL(1 << 31)
#define PIN_PC12C_ABDACB_CLK           _L(76) /**< \brief ABDACB signal: CLK on PC12 mux C */
#define MUX_PC12C_ABDACB_CLK            _L(2)
