zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/pio/sam4ls2c.h
#define PINMUX_PC12C_ABDACB_CLK    ((PIN_PC12C_ABDACB_CLK << 16) | MUX_PC12C_ABDACB_CLK)
#define GPIO_PC12C_ABDACB_CLK    _UL(1 << 12)
#define PIN_PA27C_ABDACB_DAC0          _L(27) /**< \brief ABDACB signal: DAC0 on PA27 mux C */
#define MUX_PA27C_ABDACB_DAC0           _L(2)
#define PINMUX_PA27C_ABDACB_DAC0   ((PIN_PA27C_ABDACB_DAC0 << 16) | MUX_PA27C_ABDACB_DAC0)
#define GPIO_PA27C_ABDACB_DAC0   _UL(1 << 27)
#define PIN_PB02C_ABDACB_DAC0          _L(34) /**< \brief ABDACB signal: DAC0 on PB02 mux C */
#define MUX_PB02C_ABDACB_DAC0           _L(2)
#define PINMUX_PB02C_ABDACB_DAC0   ((PIN_PB02C_ABDACB_DAC0 << 16) | MUX_PB02C_ABDACB_DAC0)
#define GPIO_PB02C_ABDACB_DAC0   _UL(1 <<  2)
#define PIN_PC09C_ABDACB_DAC0          _L(73) /**< \brief ABDACB signal: DAC0 on PC09 mux C */
#define MUX_PC09C_ABDACB_DAC0           _L(2)
#define PINMUX_PC09C_ABDACB_DAC0   ((PIN_PC09C_ABDACB_DAC0 << 16) | MUX_PC09C_ABDACB_DAC0)
#define GPIO_PC09C_ABDACB_DAC0   _UL(1 <<  9)
#define PIN_PA17B_ABDACB_DAC0          _L(17) /**< \brief ABDACB signal: DAC0 on PA17 mux B */
#define MUX_PA17B_ABDACB_DAC0           _L(1)
#define PINMUX_PA17B_ABDACB_DAC0   ((PIN_PA17B_ABDACB_DAC0 << 16) | MUX_PA17B_ABDACB_DAC0)
#define GPIO_PA17B_ABDACB_DAC0   _UL(1 << 17)
#define PIN_PA29C_ABDACB_DAC1          _L(29) /**< \brief ABDACB signal: DAC1 on PA29 mux C */
#define MUX_PA29C_ABDACB_DAC1           _L(2)
#define PINMUX_PA29C_ABDACB_DAC1   ((PIN_PA29C_ABDACB_DAC1 << 16) | MUX_PA29C_ABDACB_DAC1)
#define GPIO_PA29C_ABDACB_DAC1   _UL(1 << 29)
#define PIN_PB04C_ABDACB_DAC1          _L(36) /**< \brief ABDACB signal: DAC1 on PB04 mux C */
#define MUX_PB04C_ABDACB_DAC1           _L(2)
#define PINMUX_PB04C_ABDACB_DAC1   ((PIN_PB04C_ABDACB_DAC1 << 16) | MUX_PB04C_ABDACB_DAC1)
#define GPIO_PB04C_ABDACB_DAC1   _UL(1 <<  4)
#define PIN_PC13C_ABDACB_DAC1          _L(77) /**< \brief ABDACB signal: DAC1 on PC13 mux C */
#define MUX_PC13C_ABDACB_DAC1           _L(2)
#define PINMUX_PC13C_ABDACB_DAC1   ((PIN_PC13C_ABDACB_DAC1 << 16) | MUX_PC13C_ABDACB_DAC1)
#define GPIO_PC13C_ABDACB_DAC1   _UL(1 << 13)
#define PIN_PA19B_ABDACB_DAC1          _L(19) /**< \brief ABDACB signal: DAC1 on PA19 mux B */
#define MUX_PA19B_ABDACB_DAC1           _L(1)
#define PINMUX_PA19B_ABDACB_DAC1   ((PIN_PA19B_ABDACB_DAC1 << 16) | MUX_PA19B_ABDACB_DAC1)
#define GPIO_PA19B_ABDACB_DAC1   _UL(1 << 19)
#define PIN_PA28C_ABDACB_DACN0         _L(28) /**< \brief ABDACB signal: DACN0 on PA28 mux C */
#define MUX_PA28C_ABDACB_DACN0          _L(2)
#define PINMUX_PA28C_ABDACB_DACN0  ((PIN_PA28C_ABDACB_DACN0 << 16) | MUX_PA28C_ABDACB_DACN0)
#define GPIO_PA28C_ABDACB_DACN0  _UL(1 << 28)
#define PIN_PB03C_ABDACB_DACN0         _L(35) /**< \brief ABDACB signal: DACN0 on PB03 mux C */
#define MUX_PB03C_ABDACB_DACN0          _L(2)
#define PINMUX_PB03C_ABDACB_DACN0  ((PIN_PB03C_ABDACB_DACN0 << 16) | MUX_PB03C_ABDACB_DACN0)
#define GPIO_PB03C_ABDACB_DACN0  _UL(1 <<  3)
#define PIN_PC10C_ABDACB_DACN0         _L(74) /**< \brief ABDACB signal: DACN0 on PC10 mux C */
#define MUX_PC10C_ABDACB_DACN0          _L(2)
#define PINMUX_PC10C_ABDACB_DACN0  ((PIN_PC10C_ABDACB_DACN0 << 16) | MUX_PC10C_ABDACB_DACN0)
#define GPIO_PC10C_ABDACB_DACN0  _UL(1 << 10)
#define PIN_PA18B_ABDACB_DACN0         _L(18) /**< \brief ABDACB signal: DACN0 on PA18 mux B */
#define MUX_PA18B_ABDACB_DACN0          _L(1)
#define PINMUX_PA18B_ABDACB_DACN0  ((PIN_PA18B_ABDACB_DACN0 << 16) | MUX_PA18B_ABDACB_DACN0)
#define GPIO_PA18B_ABDACB_DACN0  _UL(1 << 18)
#define PIN_PA30C_ABDACB_DACN1         _L(30) /**< \brief ABDACB signal: DACN1 on PA30 mux C */
#define MUX_PA30C_ABDACB_DACN1          _L(2)
#define PINMUX_PA30C_ABDACB_DACN1  ((PIN_PA30C_ABDACB_DACN1 << 16) | MUX_PA30C_ABDACB_DACN1)
#define GPIO_PA30C_ABDACB_DACN1  _UL(1 << 30)
#define PIN_PB05C_ABDACB_DACN1         _L(37) /**< \brief ABDACB signal: DACN1 on PB05 mux C */
#define MUX_PB05C_ABDACB_DACN1          _L(2)
#define PINMUX_PB05C_ABDACB_DACN1  ((PIN_PB05C_ABDACB_DACN1 << 16) | MUX_PB05C_ABDACB_DACN1)
#define GPIO_PB05C_ABDACB_DACN1  _UL(1 <<  5)
#define PIN_PC14C_ABDACB_DACN1         _L(78) /**< \brief ABDACB signal: DACN1 on PC14 mux C */
#define MUX_PC14C_ABDACB_DACN1          _L(2)
#define PINMUX_PC14C_ABDACB_DACN1  ((PIN_PC14C_ABDACB_DACN1 << 16) | MUX_PC14C_ABDACB_DACN1)
#define GPIO_PC14C_ABDACB_DACN1  _UL(1 << 14)
#define PIN_PA20B_ABDACB_DACN1         _L(20) /**< \brief ABDACB signal: DACN1 on PA20 mux B */
#define MUX_PA20B_ABDACB_DACN1          _L(1)
#define PINMUX_PA20B_ABDACB_DACN1  ((PIN_PA20B_ABDACB_DACN1 << 16) | MUX_PA20B_ABDACB_DACN1)
#define GPIO_PA20B_ABDACB_DACN1  _UL(1 << 20)
/* ========== GPIO definition for PARC peripheral ========== */
#define PIN_PA17D_PARC_PCCK            _L(17) /**< \brief PARC signal: PCCK on PA17 mux D */
#define MUX_PA17D_PARC_PCCK             _L(3)
#define PINMUX_PA17D_PARC_PCCK     ((PIN_PA17D_PARC_PCCK << 16) | MUX_PA17D_PARC_PCCK)
#define GPIO_PA17D_PARC_PCCK     _UL(1 << 17)
#define PIN_PC21D_PARC_PCCK            _L(85) /**< \brief PARC signal: PCCK on PC21 mux D */
#define MUX_PC21D_PARC_PCCK             _L(3)
#define PINMUX_PC21D_PARC_PCCK     ((PIN_PC21D_PARC_PCCK << 16) | MUX_PC21D_PARC_PCCK)
#define GPIO_PC21D_PARC_PCCK     _UL(1 << 21)
#define PIN_PA09D_PARC_PCDATA0          _L(9) /**< \brief PARC signal: PCDATA0 on PA09 mux D */
#define MUX_PA09D_PARC_PCDATA0          _L(3)
#define PINMUX_PA09D_PARC_PCDATA0  ((PIN_PA09D_PARC_PCDATA0 << 16) | MUX_PA09D_PARC_PCDATA0)
#define GPIO_PA09D_PARC_PCDATA0  _UL(1 <<  9)
#define PIN_PC24D_PARC_PCDATA0         _L(88) /**< \brief PARC signal: PCDATA0 on PC24 mux D */
#define MUX_PC24D_PARC_PCDATA0          _L(3)
#define PINMUX_PC24D_PARC_PCDATA0  ((PIN_PC24D_PARC_PCDATA0 << 16) | MUX_PC24D_PARC_PCDATA0)
#define GPIO_PC24D_PARC_PCDATA0  _UL(1 << 24)
#define PIN_PA10D_PARC_PCDATA1         _L(10) /**< \brief PARC signal: PCDATA1 on PA10 mux D */
#define MUX_PA10D_PARC_PCDATA1          _L(3)
#define PINMUX_PA10D_PARC_PCDATA1  ((PIN_PA10D_PARC_PCDATA1 << 16) | MUX_PA10D_PARC_PCDATA1)
#define GPIO_PA10D_PARC_PCDATA1  _UL(1 << 10)
#define PIN_PC25D_PARC_PCDATA1         _L(89) /**< \brief PARC signal: PCDATA1 on PC25 mux D */
#define MUX_PC25D_PARC_PCDATA1          _L(3)
#define PINMUX_PC25D_PARC_PCDATA1  ((PIN_PC25D_PARC_PCDATA1 << 16) | MUX_PC25D_PARC_PCDATA1)
#define GPIO_PC25D_PARC_PCDATA1  _UL(1 << 25)
#define PIN_PA11D_PARC_PCDATA2         _L(11) /**< \brief PARC signal: PCDATA2 on PA11 mux D */
#define MUX_PA11D_PARC_PCDATA2          _L(3)
#define PINMUX_PA11D_PARC_PCDATA2  ((PIN_PA11D_PARC_PCDATA2 << 16) | MUX_PA11D_PARC_PCDATA2)
#define GPIO_PA11D_PARC_PCDATA2  _UL(1 << 11)
#define PIN_PC26D_PARC_PCDATA2         _L(90) /**< \brief PARC signal: PCDATA2 on PC26 mux D */
#define MUX_PC26D_PARC_PCDATA2          _L(3)
#define PINMUX_PC26D_PARC_PCDATA2  ((PIN_PC26D_PARC_PCDATA2 << 16) | MUX_PC26D_PARC_PCDATA2)
#define GPIO_PC26D_PARC_PCDATA2  _UL(1 << 26)
#define PIN_PA12D_PARC_PCDATA3         _L(12) /**< \brief PARC signal: PCDATA3 on PA12 mux D */
#define MUX_PA12D_PARC_PCDATA3          _L(3)
#define PINMUX_PA12D_PARC_PCDATA3  ((PIN_PA12D_PARC_PCDATA3 << 16) | MUX_PA12D_PARC_PCDATA3)
#define GPIO_PA12D_PARC_PCDATA3  _UL(1 << 12)
#define PIN_PC27D_PARC_PCDATA3         _L(91) /**< \brief PARC signal: PCDATA3 on PC27 mux D */
#define MUX_PC27D_PARC_PCDATA3          _L(3)
#define PINMUX_PC27D_PARC_PCDATA3  ((PIN_PC27D_PARC_PCDATA3 << 16) | MUX_PC27D_PARC_PCDATA3)
#define GPIO_PC27D_PARC_PCDATA3  _UL(1 << 27)
#define PIN_PA13D_PARC_PCDATA4         _L(13) /**< \brief PARC signal: PCDATA4 on PA13 mux D */
#define MUX_PA13D_PARC_PCDATA4          _L(3)
#define PINMUX_PA13D_PARC_PCDATA4  ((PIN_PA13D_PARC_PCDATA4 << 16) | MUX_PA13D_PARC_PCDATA4)
#define GPIO_PA13D_PARC_PCDATA4  _UL(1 << 13)
#define PIN_PC28D_PARC_PCDATA4         _L(92) /**< \brief PARC signal: PCDATA4 on PC28 mux D */
#define MUX_PC28D_PARC_PCDATA4          _L(3)
#define PINMUX_PC28D_PARC_PCDATA4  ((PIN_PC28D_PARC_PCDATA4 << 16) | MUX_PC28D_PARC_PCDATA4)
#define GPIO_PC28D_PARC_PCDATA4  _UL(1 << 28)
#define PIN_PA14D_PARC_PCDATA5         _L(14) /**< \brief PARC signal: PCDATA5 on PA14 mux D */
#define MUX_PA14D_PARC_PCDATA5          _L(3)
#define PINMUX_PA14D_PARC_PCDATA5  ((PIN_PA14D_PARC_PCDATA5 << 16) | MUX_PA14D_PARC_PCDATA5)
#define GPIO_PA14D_PARC_PCDATA5  _UL(1 << 14)
#define PIN_PC29D_PARC_PCDATA5         _L(93) /**< \brief PARC signal: PCDATA5 on PC29 mux D */
#define MUX_PC29D_PARC_PCDATA5          _L(3)
#define PINMUX_PC29D_PARC_PCDATA5  ((PIN_PC29D_PARC_PCDATA5 << 16) | MUX_PC29D_PARC_PCDATA5)
#define GPIO_PC29D_PARC_PCDATA5  _UL(1 << 29)
#define PIN_PA15D_PARC_PCDATA6         _L(15) /**< \brief PARC signal: PCDATA6 on PA15 mux D */
#define MUX_PA15D_PARC_PCDATA6          _L(3)
#define PINMUX_PA15D_PARC_PCDATA6  ((PIN_PA15D_PARC_PCDATA6 << 16) | MUX_PA15D_PARC_PCDATA6)
#define GPIO_PA15D_PARC_PCDATA6  _UL(1 << 15)
#define PIN_PC30D_PARC_PCDATA6         _L(94) /**< \brief PARC signal: PCDATA6 on PC30 mux D */
#define MUX_PC30D_PARC_PCDATA6          _L(3)
#define PINMUX_PC30D_PARC_PCDATA6  ((PIN_PC30D_PARC_PCDATA6 << 16) | MUX_PC30D_PARC_PCDATA6)
#define GPIO_PC30D_PARC_PCDATA6  _UL(1 << 30)
#define PIN_PA16D_PARC_PCDATA7         _L(16) /**< \brief PARC signal: PCDATA7 on PA16 mux D */
#define MUX_PA16D_PARC_PCDATA7          _L(3)
#define PINMUX_PA16D_PARC_PCDATA7  ((PIN_PA16D_PARC_PCDATA7 << 16) | MUX_PA16D_PARC_PCDATA7)
#define GPIO_PA16D_PARC_PCDATA7  _UL(1 << 16)
#define PIN_PC31D_PARC_PCDATA7         _L(95) /**< \brief PARC signal: PCDATA7 on PC31 mux D */
#define MUX_PC31D_PARC_PCDATA7          _L(3)
#define PINMUX_PC31D_PARC_PCDATA7  ((PIN_PC31D_PARC_PCDATA7 << 16) | MUX_PC31D_PARC_PCDATA7)
#define GPIO_PC31D_PARC_PCDATA7  _UL(1 << 31)
#define PIN_PA18D_PARC_PCEN1           _L(18) /**< \brief PARC signal: PCEN1 on PA18 mux D */
#define MUX_PA18D_PARC_PCEN1            _L(3)
#define PINMUX_PA18D_PARC_PCEN1    ((PIN_PA18D_PARC_PCEN1 << 16) | MUX_PA18D_PARC_PCEN1)
#define GPIO_PA18D_PARC_PCEN1    _UL(1 << 18)
#define PIN_PC22D_PARC_PCEN1           _L(86) /**< \brief PARC signal: PCEN1 on PC22 mux D */
#define MUX_PC22D_PARC_PCEN1            _L(3)
#define PINMUX_PC22D_PARC_PCEN1    ((PIN_PC22D_PARC_PCEN1 << 16) | MUX_PC22D_PARC_PCEN1)
#define GPIO_PC22D_PARC_PCEN1    _UL(1 << 22)
#define PIN_PA19D_PARC_PCEN2           _L(19) /**< \brief PARC signal: PCEN2 on PA19 mux D */
#define MUX_PA19D_PARC_PCEN2            _L(3)
#define PINMUX_PA19D_PARC_PCEN2    ((PIN_PA19D_PARC_PCEN2 << 16) | MUX_PA19D_PARC_PCEN2)
#define GPIO_PA19D_PARC_PCEN2    _UL(1 << 19)
#define PIN_PC23D_PARC_PCEN2           _L(87) /**< \brief PARC signal: PCEN2 on PC23 mux D */
#define MUX_PC23D_PARC_PCEN2            _L(3)
#define PINMUX_PC23D_PARC_PCEN2    ((PIN_PC23D_PARC_PCEN2 << 16) | MUX_PC23D_PARC_PCEN2)
#define GPIO_PC23D_PARC_PCEN2    _UL(1 << 23)
/* ========== GPIO definition for CATB peripheral ========== */
#define PIN_PA02G_CATB_DIS              _L(2) /**< \brief CATB signal: DIS on PA02 mux G */
#define MUX_PA02G_CATB_DIS              _L(6)
#define PINMUX_PA02G_CATB_DIS      ((PIN_PA02G_CATB_DIS << 16) | MUX_PA02G_CATB_DIS)
#define GPIO_PA02G_CATB_DIS      _UL(1 <<  2)
#define PIN_PA12G_CATB_DIS             _L(12) /**< \brief CATB signal: DIS on PA12 mux G */
#define MUX_PA12G_CATB_DIS              _L(6)
#define PINMUX_PA12G_CATB_DIS      ((PIN_PA12G_CATB_DIS << 16) | MUX_PA12G_CATB_DIS)
#define GPIO_PA12G_CATB_DIS      _UL(1 << 12)
#define PIN_PA23G_CATB_DIS             _L(23) /**< \brief CATB signal: DIS on PA23 mux G */
#define MUX_PA23G_CATB_DIS              _L(6)
#define PINMUX_PA23G_CATB_DIS      ((PIN_PA23G_CATB_DIS << 16) | MUX_PA23G_CATB_DIS)
#define GPIO_PA23G_CATB_DIS      _UL(1 << 23)
#define PIN_PA31G_CATB_DIS             _L(31) /**< \brief CATB signal: DIS on PA31 mux G */
#define MUX_PA31G_CATB_DIS              _L(6)
#define PINMUX_PA31G_CATB_DIS      ((PIN_PA31G_CATB_DIS << 16) | MUX_PA31G_CATB_DIS)
#define GPIO_PA31G_CATB_DIS      _UL(1 << 31)
#define PIN_PB03G_CATB_DIS             _L(35) /**< \brief CATB signal: DIS on PB03 mux G */
#define MUX_PB03G_CATB_DIS              _L(6)
#define PINMUX_PB03G_CATB_DIS      ((PIN_PB03G_CATB_DIS << 16) | MUX_PB03G_CATB_DIS)
#define GPIO_PB03G_CATB_DIS      _UL(1 <<  3)
#define PIN_PB12G_CATB_DIS             _L(44) /**< \brief CATB signal: DIS on PB12 mux G */
#define MUX_PB12G_CATB_DIS              _L(6)
#define PINMUX_PB12G_CATB_DIS      ((PIN_PB12G_CATB_DIS << 16) | MUX_PB12G_CATB_DIS)
#define GPIO_PB12G_CATB_DIS      _UL(1 << 12)
#define PIN_PC05G_CATB_DIS             _L(69) /**< \brief CATB signal: DIS on PC05 mux G */
#define MUX_PC05G_CATB_DIS              _L(6)
#define PINMUX_PC05G_CATB_DIS      ((PIN_PC05G_CATB_DIS << 16) | MUX_PC05G_CATB_DIS)
#define GPIO_PC05G_CATB_DIS      _UL(1 <<  5)
#define PIN_PC14G_CATB_DIS             _L(78) /**< \brief CATB signal: DIS on PC14 mux G */
#define MUX_PC14G_CATB_DIS              _L(6)
#define PINMUX_PC14G_CATB_DIS      ((PIN_PC14G_CATB_DIS << 16) | MUX_PC14G_CATB_DIS)
#define GPIO_PC14G_CATB_DIS      _UL(1 << 14)
#define PIN_PC23G_CATB_DIS             _L(87) /**< \brief CATB signal: DIS on PC23 mux G */
#define MUX_PC23G_CATB_DIS              _L(6)
#define PINMUX_PC23G_CATB_DIS      ((PIN_PC23G_CATB_DIS << 16) | MUX_PC23G_CATB_DIS)
#define GPIO_PC23G_CATB_DIS      _UL(1 << 23)
#define PIN_PA04G_CATB_SENSE0           _L(4) /**< \brief CATB signal: SENSE0 on PA04 mux G */
#define MUX_PA04G_CATB_SENSE0           _L(6)
#define PINMUX_PA04G_CATB_SENSE0   ((PIN_PA04G_CATB_SENSE0 << 16) | MUX_PA04G_CATB_SENSE0)
#define GPIO_PA04G_CATB_SENSE0   _UL(1 <<  4)
#define PIN_PA27G_CATB_SENSE0          _L(27) /**< \brief CATB signal: SENSE0 on PA27 mux G */
#define MUX_PA27G_CATB_SENSE0           _L(6)
#define PINMUX_PA27G_CATB_SENSE0   ((PIN_PA27G_CATB_SENSE0 << 16) | MUX_PA27G_CATB_SENSE0)
#define GPIO_PA27G_CATB_SENSE0   _UL(1 << 27)
#define PIN_PB13G_CATB_SENSE0          _L(45) /**< \brief CATB signal: SENSE0 on PB13 mux G */
#define MUX_PB13G_CATB_SENSE0           _L(6)
#define PINMUX_PB13G_CATB_SENSE0   ((PIN_PB13G_CATB_SENSE0 << 16) | MUX_PB13G_CATB_SENSE0)
#define GPIO_PB13G_CATB_SENSE0   _UL(1 << 13)
#define PIN_PA05G_CATB_SENSE1           _L(5) /**< \brief CATB signal: SENSE1 on PA05 mux G */
#define MUX_PA05G_CATB_SENSE1           _L(6)
#define PINMUX_PA05G_CATB_SENSE1   ((PIN_PA05G_CATB_SENSE1 << 16) | MUX_PA05G_CATB_SENSE1)
#define GPIO_PA05G_CATB_SENSE1   _UL(1 <<  5)
#define PIN_PA28G_CATB_SENSE1          _L(28) /**< \brief CATB signal: SENSE1 on PA28 mux G */
#define MUX_PA28G_CATB_SENSE1           _L(6)
#define PINMUX_PA28G_CATB_SENSE1   ((PIN_PA28G_CATB_SENSE1 << 16) | MUX_PA28G_CATB_SENSE1)
#define GPIO_PA28G_CATB_SENSE1   _UL(1 << 28)
#define PIN_PB14G_CATB_SENSE1          _L(46) /**< \brief CATB signal: SENSE1 on PB14 mux G */
#define MUX_PB14G_CATB_SENSE1           _L(6)
#define PINMUX_PB14G_CATB_SENSE1   ((PIN_PB14G_CATB_SENSE1 << 16) | MUX_PB14G_CATB_SENSE1)
#define GPIO_PB14G_CATB_SENSE1   _UL(1 << 14)
#define PIN_PA06G_CATB_SENSE2           _L(6) /**< \brief CATB signal: SENSE2 on PA06 mux G */
#define MUX_PA06G_CATB_SENSE2           _L(6)
#define PINMUX_PA06G_CATB_SENSE2   ((PIN_PA06G_CATB_SENSE2 << 16) | MUX_PA06G_CATB_SENSE2)
#define GPIO_PA06G_CATB_SENSE2   _UL(1 <<  6)
#define PIN_PA29G_CATB_SENSE2          _L(29) /**< \brief CATB signal: SENSE2 on PA29 mux G */
#define MUX_PA29G_CATB_SENSE2           _L(6)
#define PINMUX_PA29G_CATB_SENSE2   ((PIN_PA29G_CATB_SENSE2 << 16) | MUX_PA29G_CATB_SENSE2)
#define GPIO_PA29G_CATB_SENSE2   _UL(1 << 29)
#define PIN_PB15G_CATB_SENSE2          _L(47) /**< \brief CATB signal: SENSE2 on PB15 mux G */
#define MUX_PB15G_CATB_SENSE2           _L(6)
#define PINMUX_PB15G_CATB_SENSE2   ((PIN_PB15G_CATB_SENSE2 << 16) | MUX_PB15G_CATB_SENSE2)
#define GPIO_PB15G_CATB_SENSE2   _UL(1 << 15)
#define PIN_PA07G_CATB_SENSE3           _L(7) /**< \brief CATB signal: SENSE3 on PA07 mux G */
#define MUX_PA07G_CATB_SENSE3           _L(6)
#define PINMUX_PA07G_CATB_SENSE3   ((PIN_PA07G_CATB_SENSE3 << 16) | MUX_PA07G_CATB_SENSE3)
#define GPIO_PA07G_CATB_SENSE3   _UL(1 <<  7)
#define PIN_PA30G_CATB_SENSE3          _L(30) /**< \brief CATB signal: SENSE3 on PA30 mux G */
#define MUX_PA30G_CATB_SENSE3           _L(6)
#define PINMUX_PA30G_CATB_SENSE3   ((PIN_PA30G_CATB_SENSE3 << 16) | MUX_PA30G_CATB_SENSE3)
#define GPIO_PA30G_CATB_SENSE3   _UL(1 << 30)
#define PIN_PC00G_CATB_SENSE3          _L(64) /**< \brief CATB signal: SENSE3 on PC00 mux G */
#define MUX_PC00G_CATB_SENSE3           _L(6)
#define PINMUX_PC00G_CATB_SENSE3   ((PIN_PC00G_CATB_SENSE3 << 16) | MUX_PC00G_CATB_SENSE3)
#define GPIO_PC00G_CATB_SENSE3   _UL(1 <<  0)
#define PIN_PA08G_CATB_SENSE4           _L(8) /**< \brief CATB signal: SENSE4 on PA08 mux G */
#define MUX_PA08G_CATB_SENSE4           _L(6)
#define PINMUX_PA08G_CATB_SENSE4   ((PIN_PA08G_CATB_SENSE4 << 16) | MUX_PA08G_CATB_SENSE4)
#define GPIO_PA08G_CATB_SENSE4   _UL(1 <<  8)
#define PIN_PC01G_CATB_SENSE4          _L(65) /**< \brief CATB signal: SENSE4 on PC01 mux G */
#define MUX_PC01G_CATB_SENSE4           _L(6)
#define PINMUX_PC01G_CATB_SENSE4   ((PIN_PC01G_CATB_SENSE4 << 16) | MUX_PC01G_CATB_SENSE4)
#define GPIO_PC01G_CATB_SENSE4   _UL(1 <<  1)
#define PIN_PA09G_CATB_SENSE5           _L(9) /**< \brief CATB signal: SENSE5 on PA09 mux G */
#define MUX_PA09G_CATB_SENSE5           _L(6)
#define PINMUX_PA09G_CATB_SENSE5   ((PIN_PA09G_CATB_SENSE5 << 16) | MUX_PA09G_CATB_SENSE5)
#define GPIO_PA09G_CATB_SENSE5   _UL(1 <<  9)
#define PIN_PC02G_CATB_SENSE5          _L(66) /**< \brief CATB signal: SENSE5 on PC02 mux G */
#define MUX_PC02G_CATB_SENSE5           _L(6)
#define PINMUX_PC02G_CATB_SENSE5   ((PIN_PC02G_CATB_SENSE5 << 16) | MUX_PC02G_CATB_SENSE5)
#define GPIO_PC02G_CATB_SENSE5   _UL(1 <<  2)
#define PIN_PA10G_CATB_SENSE6          _L(10) /**< \brief CATB signal: SENSE6 on PA10 mux G */
#define MUX_PA10G_CATB_SENSE6           _L(6)
#define PINMUX_PA10G_CATB_SENSE6   ((PIN_PA10G_CATB_SENSE6 << 16) | MUX_PA10G_CATB_SENSE6)
#define GPIO_PA10G_CATB_SENSE6   _UL(1 << 10)
#define PIN_PC03G_CATB_SENSE6          _L(67) /**< \brief CATB signal: SENSE6 on PC03 mux G */
#define MUX_PC03G_CATB_SENSE6           _L(6)
#define PINMUX_PC03G_CATB_SENSE6   ((PIN_PC03G_CATB_SENSE6 << 16) | MUX_PC03G_CATB_SENSE6)
#define GPIO_PC03G_CATB_SENSE6   _UL(1 <<  3)
#define PIN_PA11G_CATB_SENSE7          _L(11) /**< \brief CATB signal: SENSE7 on PA11 mux G */
#define MUX_PA11G_CATB_SENSE7           _L(6)
#define PINMUX_PA11G_CATB_SENSE7   ((PIN_PA11G_CATB_SENSE7 << 16) | MUX_PA11G_CATB_SENSE7)
#define GPIO_PA11G_CATB_SENSE7   _UL(1 << 11)
#define PIN_PC04G_CATB_SENSE7          _L(68) /**< \brief CATB signal: SENSE7 on PC04 mux G */
#define MUX_PC04G_CATB_SENSE7           _L(6)
#define PINMUX_PC04G_CATB_SENSE7   ((PIN_PC04G_CATB_SENSE7 << 16) | MUX_PC04G_CATB_SENSE7)
#define GPIO_PC04G_CATB_SENSE7   _UL(1 <<  4)
#define PIN_PA13G_CATB_SENSE8          _L(13) /**< \brief CATB signal: SENSE8 on PA13 mux G */
#define MUX_PA13G_CATB_SENSE8           _L(6)
#define PINMUX_PA13G_CATB_SENSE8   ((PIN_PA13G_CATB_SENSE8 << 16) | MUX_PA13G_CATB_SENSE8)
#define GPIO_PA13G_CATB_SENSE8   _UL(1 << 13)
#define PIN_PC06G_CATB_SENSE8          _L(70) /**< \brief CATB signal: SENSE8 on PC06 mux G */
#define MUX_PC06G_CATB_SENSE8           _L(6)
#define PINMUX_PC06G_CATB_SENSE8   ((PIN_PC06G_CATB_SENSE8 << 16) | MUX_PC06G_CATB_SENSE8)
#define GPIO_PC06G_CATB_SENSE8   _UL(1 <<  6)
#define PIN_PA14G_CATB_SENSE9          _L(14) /**< \brief CATB signal: SENSE9 on PA14 mux G */
#define MUX_PA14G_CATB_SENSE9           _L(6)
#define PINMUX_PA14G_CATB_SENSE9   ((PIN_PA14G_CATB_SENSE9 << 16) | MUX_PA14G_CATB_SENSE9)
#define GPIO_PA14G_CATB_SENSE9   _UL(1 << 14)
#define PIN_PC07G_CATB_SENSE9          _L(71) /**< \brief CATB signal: SENSE9 on PC07 mux G */
#define MUX_PC07G_CATB_SENSE9           _L(6)
#define PINMUX_PC07G_CATB_SENSE9   ((PIN_PC07G_CATB_SENSE9 << 16) | MUX_PC07G_CATB_SENSE9)
#define GPIO_PC07G_CATB_SENSE9   _UL(1 <<  7)
#define PIN_PA15G_CATB_SENSE10         _L(15) /**< \brief CATB signal: SENSE10 on PA15 mux G */
#define MUX_PA15G_CATB_SENSE10          _L(6)
#define PINMUX_PA15G_CATB_SENSE10  ((PIN_PA15G_CATB_SENSE10 << 16) | MUX_PA15G_CATB_SENSE10)
#define GPIO_PA15G_CATB_SENSE10  _UL(1 << 15)
#define PIN_PC08G_CATB_SENSE10         _L(72) /**< \brief CATB signal: SENSE10 on PC08 mux G */
#define MUX_PC08G_CATB_SENSE10          _L(6)
#define PINMUX_PC08G_CATB_SENSE10  ((PIN_PC08G_CATB_SENSE10 << 16) | MUX_PC08G_CATB_SENSE10)
#define GPIO_PC08G_CATB_SENSE10  _UL(1 <<  8)
#define PIN_PA16G_CATB_SENSE11         _L(16) /**< \brief CATB signal: SENSE11 on PA16 mux G */
#define MUX_PA16G_CATB_SENSE11          _L(6)
#define PINMUX_PA16G_CATB_SENSE11  ((PIN_PA16G_CATB_SENSE11 << 16) | MUX_PA16G_CATB_SENSE11)
#define GPIO_PA16G_CATB_SENSE11  _UL(1 << 16)
#define PIN_PC09G_CATB_SENSE11         _L(73) /**< \brief CATB signal: SENSE11 on PC09 mux G */
#define MUX_PC09G_CATB_SENSE11          _L(6)
#define PINMUX_PC09G_CATB_SENSE11  ((PIN_PC09G_CATB_SENSE11 << 16) | MUX_PC09G_CATB_SENSE11)
#define GPIO_PC09G_CATB_SENSE11  _UL(1 <<  9)
#define PIN_PA17G_CATB_SENSE12         _L(17) /**< \brief CATB signal: SENSE12 on PA17 mux G */
#define MUX_PA17G_CATB_SENSE12          _L(6)
#define PINMUX_PA17G_CATB_SENSE12  ((PIN_PA17G_CATB_SENSE12 << 16) | MUX_PA17G_CATB_SENSE12)
#define GPIO_PA17G_CATB_SENSE12  _UL(1 << 17)
#define PIN_PC10G_CATB_SENSE12         _L(74) /**< \brief CATB signal: SENSE12 on PC10 mux G */
#define MUX_PC10G_CATB_SENSE12          _L(6)
#define PINMUX_PC10G_CATB_SENSE12  ((PIN_PC10G_CATB_SENSE12 << 16) | MUX_PC10G_CATB_SENSE12)
#define GPIO_PC10G_CATB_SENSE12  _UL(1 << 10)
#define PIN_PA18G_CATB_SENSE13         _L(18) /**< \brief CATB signal: SENSE13 on PA18 mux G */
#define MUX_PA18G_CATB_SENSE13          _L(6)
#define PINMUX_PA18G_CATB_SENSE13  ((PIN_PA18G_CATB_SENSE13 << 16) | MUX_PA18G_CATB_SENSE13)
#define GPIO_PA18G_CATB_SENSE13  _UL(1 << 18)
#define PIN_PC11G_CATB_SENSE13         _L(75) /**< \brief CATB signal: SENSE13 on PC11 mux G */
#define MUX_PC11G_CATB_SENSE13          _L(6)
#define PINMUX_PC11G_CATB_SENSE13  ((PIN_PC11G_CATB_SENSE13 << 16) | MUX_PC11G_CATB_SENSE13)
#define GPIO_PC11G_CATB_SENSE13  _UL(1 << 11)
#define PIN_PA19G_CATB_SENSE14         _L(19) /**< \brief CATB signal: SENSE14 on PA19 mux G */
#define MUX_PA19G_CATB_SENSE14          _L(6)
#define PINMUX_PA19G_CATB_SENSE14  ((PIN_PA19G_CATB_SENSE14 << 16) | MUX_PA19G_CATB_SENSE14)
#define GPIO_PA19G_CATB_SENSE14  _UL(1 << 19)
#define PIN_PC12G_CATB_SENSE14         _L(76) /**< \brief CATB signal: SENSE14 on PC12 mux G */
#define MUX_PC12G_CATB_SENSE14          _L(6)
#define PINMUX_PC12G_CATB_SENSE14  ((PIN_PC12G_CATB_SENSE14 << 16) | MUX_PC12G_CATB_SENSE14)
#define GPIO_PC12G_CATB_SENSE14  _UL(1 << 12)
#define PIN_PA20G_CATB_SENSE15         _L(20) /**< \brief CATB signal: SENSE15 on PA20 mux G */
#define MUX_PA20G_CATB_SENSE15          _L(6)
#define PINMUX_PA20G_CATB_SENSE15  ((PIN_PA20G_CATB_SENSE15 << 16) | MUX_PA20G_CATB_SENSE15)
#define GPIO_PA20G_CATB_SENSE15  _UL(1 << 20)
#define PIN_PC13G_CATB_SENSE15         _L(77) /**< \brief CATB signal: SENSE15 on PC13 mux G */
#define MUX_PC13G_CATB_SENSE15          _L(6)
#define PINMUX_PC13G_CATB_SENSE15  ((PIN_PC13G_CATB_SENSE15 << 16) | MUX_PC13G_CATB_SENSE15)
#define GPIO_PC13G_CATB_SENSE15  _UL(1 << 13)
#define PIN_PA21G_CATB_SENSE16         _L(21) /**< \brief CATB signal: SENSE16 on PA21 mux G */
#define MUX_PA21G_CATB_SENSE16          _L(6)
#define PINMUX_PA21G_CATB_SENSE16  ((PIN_PA21G_CATB_SENSE16 << 16) | MUX_PA21G_CATB_SENSE16)
#define GPIO_PA21G_CATB_SENSE16  _UL(1 << 21)
#define PIN_PC15G_CATB_SENSE16         _L(79) /**< \brief CATB signal: SENSE16 on PC15 mux G */
#define MUX_PC15G_CATB_SENSE16          _L(6)
#define PINMUX_PC15G_CATB_SENSE16  ((PIN_PC15G_CATB_SENSE16 << 16) | MUX_PC15G_CATB_SENSE16)
#define GPIO_PC15G_CATB_SENSE16  _UL(1 << 15)
#define PIN_PA22G_CATB_SENSE17         _L(22) /**< \brief CATB signal: SENSE17 on PA22 mux G */
