zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/pio/sam4ls2c.h
#define MUX_PA22G_CATB_SENSE17          _L(6)
#define PINMUX_PA22G_CATB_SENSE17  ((PIN_PA22G_CATB_SENSE17 << 16) | MUX_PA22G_CATB_SENSE17)
#define GPIO_PA22G_CATB_SENSE17  _UL(1 << 22)
#define PIN_PC16G_CATB_SENSE17         _L(80) /**< \brief CATB signal: SENSE17 on PC16 mux G */
#define MUX_PC16G_CATB_SENSE17          _L(6)
#define PINMUX_PC16G_CATB_SENSE17  ((PIN_PC16G_CATB_SENSE17 << 16) | MUX_PC16G_CATB_SENSE17)
#define GPIO_PC16G_CATB_SENSE17  _UL(1 << 16)
#define PIN_PA24G_CATB_SENSE18         _L(24) /**< \brief CATB signal: SENSE18 on PA24 mux G */
#define MUX_PA24G_CATB_SENSE18          _L(6)
#define PINMUX_PA24G_CATB_SENSE18  ((PIN_PA24G_CATB_SENSE18 << 16) | MUX_PA24G_CATB_SENSE18)
#define GPIO_PA24G_CATB_SENSE18  _UL(1 << 24)
#define PIN_PC17G_CATB_SENSE18         _L(81) /**< \brief CATB signal: SENSE18 on PC17 mux G */
#define MUX_PC17G_CATB_SENSE18          _L(6)
#define PINMUX_PC17G_CATB_SENSE18  ((PIN_PC17G_CATB_SENSE18 << 16) | MUX_PC17G_CATB_SENSE18)
#define GPIO_PC17G_CATB_SENSE18  _UL(1 << 17)
#define PIN_PA25G_CATB_SENSE19         _L(25) /**< \brief CATB signal: SENSE19 on PA25 mux G */
#define MUX_PA25G_CATB_SENSE19          _L(6)
#define PINMUX_PA25G_CATB_SENSE19  ((PIN_PA25G_CATB_SENSE19 << 16) | MUX_PA25G_CATB_SENSE19)
#define GPIO_PA25G_CATB_SENSE19  _UL(1 << 25)
#define PIN_PC18G_CATB_SENSE19         _L(82) /**< \brief CATB signal: SENSE19 on PC18 mux G */
#define MUX_PC18G_CATB_SENSE19          _L(6)
#define PINMUX_PC18G_CATB_SENSE19  ((PIN_PC18G_CATB_SENSE19 << 16) | MUX_PC18G_CATB_SENSE19)
#define GPIO_PC18G_CATB_SENSE19  _UL(1 << 18)
#define PIN_PA26G_CATB_SENSE20         _L(26) /**< \brief CATB signal: SENSE20 on PA26 mux G */
#define MUX_PA26G_CATB_SENSE20          _L(6)
#define PINMUX_PA26G_CATB_SENSE20  ((PIN_PA26G_CATB_SENSE20 << 16) | MUX_PA26G_CATB_SENSE20)
#define GPIO_PA26G_CATB_SENSE20  _UL(1 << 26)
#define PIN_PC19G_CATB_SENSE20         _L(83) /**< \brief CATB signal: SENSE20 on PC19 mux G */
#define MUX_PC19G_CATB_SENSE20          _L(6)
#define PINMUX_PC19G_CATB_SENSE20  ((PIN_PC19G_CATB_SENSE20 << 16) | MUX_PC19G_CATB_SENSE20)
#define GPIO_PC19G_CATB_SENSE20  _UL(1 << 19)
#define PIN_PB00G_CATB_SENSE21         _L(32) /**< \brief CATB signal: SENSE21 on PB00 mux G */
#define MUX_PB00G_CATB_SENSE21          _L(6)
#define PINMUX_PB00G_CATB_SENSE21  ((PIN_PB00G_CATB_SENSE21 << 16) | MUX_PB00G_CATB_SENSE21)
#define GPIO_PB00G_CATB_SENSE21  _UL(1 <<  0)
#define PIN_PC20G_CATB_SENSE21         _L(84) /**< \brief CATB signal: SENSE21 on PC20 mux G */
#define MUX_PC20G_CATB_SENSE21          _L(6)
#define PINMUX_PC20G_CATB_SENSE21  ((PIN_PC20G_CATB_SENSE21 << 16) | MUX_PC20G_CATB_SENSE21)
#define GPIO_PC20G_CATB_SENSE21  _UL(1 << 20)
#define PIN_PB01G_CATB_SENSE22         _L(33) /**< \brief CATB signal: SENSE22 on PB01 mux G */
#define MUX_PB01G_CATB_SENSE22          _L(6)
#define PINMUX_PB01G_CATB_SENSE22  ((PIN_PB01G_CATB_SENSE22 << 16) | MUX_PB01G_CATB_SENSE22)
#define GPIO_PB01G_CATB_SENSE22  _UL(1 <<  1)
#define PIN_PC21G_CATB_SENSE22         _L(85) /**< \brief CATB signal: SENSE22 on PC21 mux G */
#define MUX_PC21G_CATB_SENSE22          _L(6)
#define PINMUX_PC21G_CATB_SENSE22  ((PIN_PC21G_CATB_SENSE22 << 16) | MUX_PC21G_CATB_SENSE22)
#define GPIO_PC21G_CATB_SENSE22  _UL(1 << 21)
#define PIN_PB02G_CATB_SENSE23         _L(34) /**< \brief CATB signal: SENSE23 on PB02 mux G */
#define MUX_PB02G_CATB_SENSE23          _L(6)
#define PINMUX_PB02G_CATB_SENSE23  ((PIN_PB02G_CATB_SENSE23 << 16) | MUX_PB02G_CATB_SENSE23)
#define GPIO_PB02G_CATB_SENSE23  _UL(1 <<  2)
#define PIN_PC22G_CATB_SENSE23         _L(86) /**< \brief CATB signal: SENSE23 on PC22 mux G */
#define MUX_PC22G_CATB_SENSE23          _L(6)
#define PINMUX_PC22G_CATB_SENSE23  ((PIN_PC22G_CATB_SENSE23 << 16) | MUX_PC22G_CATB_SENSE23)
#define GPIO_PC22G_CATB_SENSE23  _UL(1 << 22)
#define PIN_PB04G_CATB_SENSE24         _L(36) /**< \brief CATB signal: SENSE24 on PB04 mux G */
#define MUX_PB04G_CATB_SENSE24          _L(6)
#define PINMUX_PB04G_CATB_SENSE24  ((PIN_PB04G_CATB_SENSE24 << 16) | MUX_PB04G_CATB_SENSE24)
#define GPIO_PB04G_CATB_SENSE24  _UL(1 <<  4)
#define PIN_PC24G_CATB_SENSE24         _L(88) /**< \brief CATB signal: SENSE24 on PC24 mux G */
#define MUX_PC24G_CATB_SENSE24          _L(6)
#define PINMUX_PC24G_CATB_SENSE24  ((PIN_PC24G_CATB_SENSE24 << 16) | MUX_PC24G_CATB_SENSE24)
#define GPIO_PC24G_CATB_SENSE24  _UL(1 << 24)
#define PIN_PB05G_CATB_SENSE25         _L(37) /**< \brief CATB signal: SENSE25 on PB05 mux G */
#define MUX_PB05G_CATB_SENSE25          _L(6)
#define PINMUX_PB05G_CATB_SENSE25  ((PIN_PB05G_CATB_SENSE25 << 16) | MUX_PB05G_CATB_SENSE25)
#define GPIO_PB05G_CATB_SENSE25  _UL(1 <<  5)
#define PIN_PC25G_CATB_SENSE25         _L(89) /**< \brief CATB signal: SENSE25 on PC25 mux G */
#define MUX_PC25G_CATB_SENSE25          _L(6)
#define PINMUX_PC25G_CATB_SENSE25  ((PIN_PC25G_CATB_SENSE25 << 16) | MUX_PC25G_CATB_SENSE25)
#define GPIO_PC25G_CATB_SENSE25  _UL(1 << 25)
#define PIN_PB06G_CATB_SENSE26         _L(38) /**< \brief CATB signal: SENSE26 on PB06 mux G */
#define MUX_PB06G_CATB_SENSE26          _L(6)
#define PINMUX_PB06G_CATB_SENSE26  ((PIN_PB06G_CATB_SENSE26 << 16) | MUX_PB06G_CATB_SENSE26)
#define GPIO_PB06G_CATB_SENSE26  _UL(1 <<  6)
#define PIN_PC26G_CATB_SENSE26         _L(90) /**< \brief CATB signal: SENSE26 on PC26 mux G */
#define MUX_PC26G_CATB_SENSE26          _L(6)
#define PINMUX_PC26G_CATB_SENSE26  ((PIN_PC26G_CATB_SENSE26 << 16) | MUX_PC26G_CATB_SENSE26)
#define GPIO_PC26G_CATB_SENSE26  _UL(1 << 26)
#define PIN_PB07G_CATB_SENSE27         _L(39) /**< \brief CATB signal: SENSE27 on PB07 mux G */
#define MUX_PB07G_CATB_SENSE27          _L(6)
#define PINMUX_PB07G_CATB_SENSE27  ((PIN_PB07G_CATB_SENSE27 << 16) | MUX_PB07G_CATB_SENSE27)
#define GPIO_PB07G_CATB_SENSE27  _UL(1 <<  7)
#define PIN_PC27G_CATB_SENSE27         _L(91) /**< \brief CATB signal: SENSE27 on PC27 mux G */
#define MUX_PC27G_CATB_SENSE27          _L(6)
#define PINMUX_PC27G_CATB_SENSE27  ((PIN_PC27G_CATB_SENSE27 << 16) | MUX_PC27G_CATB_SENSE27)
#define GPIO_PC27G_CATB_SENSE27  _UL(1 << 27)
#define PIN_PB08G_CATB_SENSE28         _L(40) /**< \brief CATB signal: SENSE28 on PB08 mux G */
#define MUX_PB08G_CATB_SENSE28          _L(6)
#define PINMUX_PB08G_CATB_SENSE28  ((PIN_PB08G_CATB_SENSE28 << 16) | MUX_PB08G_CATB_SENSE28)
#define GPIO_PB08G_CATB_SENSE28  _UL(1 <<  8)
#define PIN_PC28G_CATB_SENSE28         _L(92) /**< \brief CATB signal: SENSE28 on PC28 mux G */
#define MUX_PC28G_CATB_SENSE28          _L(6)
#define PINMUX_PC28G_CATB_SENSE28  ((PIN_PC28G_CATB_SENSE28 << 16) | MUX_PC28G_CATB_SENSE28)
#define GPIO_PC28G_CATB_SENSE28  _UL(1 << 28)
#define PIN_PB09G_CATB_SENSE29         _L(41) /**< \brief CATB signal: SENSE29 on PB09 mux G */
#define MUX_PB09G_CATB_SENSE29          _L(6)
#define PINMUX_PB09G_CATB_SENSE29  ((PIN_PB09G_CATB_SENSE29 << 16) | MUX_PB09G_CATB_SENSE29)
#define GPIO_PB09G_CATB_SENSE29  _UL(1 <<  9)
#define PIN_PC29G_CATB_SENSE29         _L(93) /**< \brief CATB signal: SENSE29 on PC29 mux G */
#define MUX_PC29G_CATB_SENSE29          _L(6)
#define PINMUX_PC29G_CATB_SENSE29  ((PIN_PC29G_CATB_SENSE29 << 16) | MUX_PC29G_CATB_SENSE29)
#define GPIO_PC29G_CATB_SENSE29  _UL(1 << 29)
#define PIN_PB10G_CATB_SENSE30         _L(42) /**< \brief CATB signal: SENSE30 on PB10 mux G */
#define MUX_PB10G_CATB_SENSE30          _L(6)
#define PINMUX_PB10G_CATB_SENSE30  ((PIN_PB10G_CATB_SENSE30 << 16) | MUX_PB10G_CATB_SENSE30)
#define GPIO_PB10G_CATB_SENSE30  _UL(1 << 10)
#define PIN_PC30G_CATB_SENSE30         _L(94) /**< \brief CATB signal: SENSE30 on PC30 mux G */
#define MUX_PC30G_CATB_SENSE30          _L(6)
#define PINMUX_PC30G_CATB_SENSE30  ((PIN_PC30G_CATB_SENSE30 << 16) | MUX_PC30G_CATB_SENSE30)
#define GPIO_PC30G_CATB_SENSE30  _UL(1 << 30)
#define PIN_PB11G_CATB_SENSE31         _L(43) /**< \brief CATB signal: SENSE31 on PB11 mux G */
#define MUX_PB11G_CATB_SENSE31          _L(6)
#define PINMUX_PB11G_CATB_SENSE31  ((PIN_PB11G_CATB_SENSE31 << 16) | MUX_PB11G_CATB_SENSE31)
#define GPIO_PB11G_CATB_SENSE31  _UL(1 << 11)
#define PIN_PC31G_CATB_SENSE31         _L(95) /**< \brief CATB signal: SENSE31 on PC31 mux G */
#define MUX_PC31G_CATB_SENSE31          _L(6)
#define PINMUX_PC31G_CATB_SENSE31  ((PIN_PC31G_CATB_SENSE31 << 16) | MUX_PC31G_CATB_SENSE31)
#define GPIO_PC31G_CATB_SENSE31  _UL(1 << 31)
/* ========== GPIO definition for USBC peripheral ========== */
#define PIN_PA25A_USBC_DM              _L(25) /**< \brief USBC signal: DM on PA25 mux A */
#define MUX_PA25A_USBC_DM               _L(0)
#define PINMUX_PA25A_USBC_DM       ((PIN_PA25A_USBC_DM << 16) | MUX_PA25A_USBC_DM)
#define GPIO_PA25A_USBC_DM       _UL(1 << 25)
#define PIN_PA26A_USBC_DP              _L(26) /**< \brief USBC signal: DP on PA26 mux A */
#define MUX_PA26A_USBC_DP               _L(0)
#define PINMUX_PA26A_USBC_DP       ((PIN_PA26A_USBC_DP << 16) | MUX_PA26A_USBC_DP)
#define GPIO_PA26A_USBC_DP       _UL(1 << 26)
/* ========== GPIO definition for PEVC peripheral ========== */
#define PIN_PA08C_PEVC_PAD_EVT0         _L(8) /**< \brief PEVC signal: PAD_EVT0 on PA08 mux C */
#define MUX_PA08C_PEVC_PAD_EVT0         _L(2)
#define PINMUX_PA08C_PEVC_PAD_EVT0  ((PIN_PA08C_PEVC_PAD_EVT0 << 16) | MUX_PA08C_PEVC_PAD_EVT0)
#define GPIO_PA08C_PEVC_PAD_EVT0  _UL(1 <<  8)
#define PIN_PB12C_PEVC_PAD_EVT0        _L(44) /**< \brief PEVC signal: PAD_EVT0 on PB12 mux C */
#define MUX_PB12C_PEVC_PAD_EVT0         _L(2)
#define PINMUX_PB12C_PEVC_PAD_EVT0  ((PIN_PB12C_PEVC_PAD_EVT0 << 16) | MUX_PB12C_PEVC_PAD_EVT0)
#define GPIO_PB12C_PEVC_PAD_EVT0  _UL(1 << 12)
#define PIN_PC07C_PEVC_PAD_EVT0        _L(71) /**< \brief PEVC signal: PAD_EVT0 on PC07 mux C */
#define MUX_PC07C_PEVC_PAD_EVT0         _L(2)
#define PINMUX_PC07C_PEVC_PAD_EVT0  ((PIN_PC07C_PEVC_PAD_EVT0 << 16) | MUX_PC07C_PEVC_PAD_EVT0)
#define GPIO_PC07C_PEVC_PAD_EVT0  _UL(1 <<  7)
#define PIN_PC24C_PEVC_PAD_EVT0        _L(88) /**< \brief PEVC signal: PAD_EVT0 on PC24 mux C */
#define MUX_PC24C_PEVC_PAD_EVT0         _L(2)
#define PINMUX_PC24C_PEVC_PAD_EVT0  ((PIN_PC24C_PEVC_PAD_EVT0 << 16) | MUX_PC24C_PEVC_PAD_EVT0)
#define GPIO_PC24C_PEVC_PAD_EVT0  _UL(1 << 24)
#define PIN_PA09C_PEVC_PAD_EVT1         _L(9) /**< \brief PEVC signal: PAD_EVT1 on PA09 mux C */
#define MUX_PA09C_PEVC_PAD_EVT1         _L(2)
#define PINMUX_PA09C_PEVC_PAD_EVT1  ((PIN_PA09C_PEVC_PAD_EVT1 << 16) | MUX_PA09C_PEVC_PAD_EVT1)
#define GPIO_PA09C_PEVC_PAD_EVT1  _UL(1 <<  9)
#define PIN_PB13C_PEVC_PAD_EVT1        _L(45) /**< \brief PEVC signal: PAD_EVT1 on PB13 mux C */
#define MUX_PB13C_PEVC_PAD_EVT1         _L(2)
#define PINMUX_PB13C_PEVC_PAD_EVT1  ((PIN_PB13C_PEVC_PAD_EVT1 << 16) | MUX_PB13C_PEVC_PAD_EVT1)
#define GPIO_PB13C_PEVC_PAD_EVT1  _UL(1 << 13)
#define PIN_PC08C_PEVC_PAD_EVT1        _L(72) /**< \brief PEVC signal: PAD_EVT1 on PC08 mux C */
#define MUX_PC08C_PEVC_PAD_EVT1         _L(2)
#define PINMUX_PC08C_PEVC_PAD_EVT1  ((PIN_PC08C_PEVC_PAD_EVT1 << 16) | MUX_PC08C_PEVC_PAD_EVT1)
#define GPIO_PC08C_PEVC_PAD_EVT1  _UL(1 <<  8)
#define PIN_PC25C_PEVC_PAD_EVT1        _L(89) /**< \brief PEVC signal: PAD_EVT1 on PC25 mux C */
#define MUX_PC25C_PEVC_PAD_EVT1         _L(2)
#define PINMUX_PC25C_PEVC_PAD_EVT1  ((PIN_PC25C_PEVC_PAD_EVT1 << 16) | MUX_PC25C_PEVC_PAD_EVT1)
#define GPIO_PC25C_PEVC_PAD_EVT1  _UL(1 << 25)
#define PIN_PA10C_PEVC_PAD_EVT2        _L(10) /**< \brief PEVC signal: PAD_EVT2 on PA10 mux C */
#define MUX_PA10C_PEVC_PAD_EVT2         _L(2)
#define PINMUX_PA10C_PEVC_PAD_EVT2  ((PIN_PA10C_PEVC_PAD_EVT2 << 16) | MUX_PA10C_PEVC_PAD_EVT2)
#define GPIO_PA10C_PEVC_PAD_EVT2  _UL(1 << 10)
#define PIN_PC11C_PEVC_PAD_EVT2        _L(75) /**< \brief PEVC signal: PAD_EVT2 on PC11 mux C */
#define MUX_PC11C_PEVC_PAD_EVT2         _L(2)
#define PINMUX_PC11C_PEVC_PAD_EVT2  ((PIN_PC11C_PEVC_PAD_EVT2 << 16) | MUX_PC11C_PEVC_PAD_EVT2)
#define GPIO_PC11C_PEVC_PAD_EVT2  _UL(1 << 11)
#define PIN_PC26C_PEVC_PAD_EVT2        _L(90) /**< \brief PEVC signal: PAD_EVT2 on PC26 mux C */
#define MUX_PC26C_PEVC_PAD_EVT2         _L(2)
#define PINMUX_PC26C_PEVC_PAD_EVT2  ((PIN_PC26C_PEVC_PAD_EVT2 << 16) | MUX_PC26C_PEVC_PAD_EVT2)
#define GPIO_PC26C_PEVC_PAD_EVT2  _UL(1 << 26)
#define PIN_PB09B_PEVC_PAD_EVT2        _L(41) /**< \brief PEVC signal: PAD_EVT2 on PB09 mux B */
#define MUX_PB09B_PEVC_PAD_EVT2         _L(1)
#define PINMUX_PB09B_PEVC_PAD_EVT2  ((PIN_PB09B_PEVC_PAD_EVT2 << 16) | MUX_PB09B_PEVC_PAD_EVT2)
#define GPIO_PB09B_PEVC_PAD_EVT2  _UL(1 <<  9)
#define PIN_PA11C_PEVC_PAD_EVT3        _L(11) /**< \brief PEVC signal: PAD_EVT3 on PA11 mux C */
#define MUX_PA11C_PEVC_PAD_EVT3         _L(2)
#define PINMUX_PA11C_PEVC_PAD_EVT3  ((PIN_PA11C_PEVC_PAD_EVT3 << 16) | MUX_PA11C_PEVC_PAD_EVT3)
#define GPIO_PA11C_PEVC_PAD_EVT3  _UL(1 << 11)
#define PIN_PC27C_PEVC_PAD_EVT3        _L(91) /**< \brief PEVC signal: PAD_EVT3 on PC27 mux C */
#define MUX_PC27C_PEVC_PAD_EVT3         _L(2)
#define PINMUX_PC27C_PEVC_PAD_EVT3  ((PIN_PC27C_PEVC_PAD_EVT3 << 16) | MUX_PC27C_PEVC_PAD_EVT3)
#define GPIO_PC27C_PEVC_PAD_EVT3  _UL(1 << 27)
#define PIN_PB10B_PEVC_PAD_EVT3        _L(42) /**< \brief PEVC signal: PAD_EVT3 on PB10 mux B */
#define MUX_PB10B_PEVC_PAD_EVT3         _L(1)
#define PINMUX_PB10B_PEVC_PAD_EVT3  ((PIN_PB10B_PEVC_PAD_EVT3 << 16) | MUX_PB10B_PEVC_PAD_EVT3)
#define GPIO_PB10B_PEVC_PAD_EVT3  _UL(1 << 10)
/* ========== GPIO definition for SCIF peripheral ========== */
#define PIN_PA19E_SCIF_GCLK0           _L(19) /**< \brief SCIF signal: GCLK0 on PA19 mux E */
#define MUX_PA19E_SCIF_GCLK0            _L(4)
#define PINMUX_PA19E_SCIF_GCLK0    ((PIN_PA19E_SCIF_GCLK0 << 16) | MUX_PA19E_SCIF_GCLK0)
#define GPIO_PA19E_SCIF_GCLK0    _UL(1 << 19)
#define PIN_PB10E_SCIF_GCLK0           _L(42) /**< \brief SCIF signal: GCLK0 on PB10 mux E */
#define MUX_PB10E_SCIF_GCLK0            _L(4)
#define PINMUX_PB10E_SCIF_GCLK0    ((PIN_PB10E_SCIF_GCLK0 << 16) | MUX_PB10E_SCIF_GCLK0)
#define GPIO_PB10E_SCIF_GCLK0    _UL(1 << 10)
#define PIN_PC26E_SCIF_GCLK0           _L(90) /**< \brief SCIF signal: GCLK0 on PC26 mux E */
#define MUX_PC26E_SCIF_GCLK0            _L(4)
#define PINMUX_PC26E_SCIF_GCLK0    ((PIN_PC26E_SCIF_GCLK0 << 16) | MUX_PC26E_SCIF_GCLK0)
#define GPIO_PC26E_SCIF_GCLK0    _UL(1 << 26)
#define PIN_PA02A_SCIF_GCLK0            _L(2) /**< \brief SCIF signal: GCLK0 on PA02 mux A */
#define MUX_PA02A_SCIF_GCLK0            _L(0)
#define PINMUX_PA02A_SCIF_GCLK0    ((PIN_PA02A_SCIF_GCLK0 << 16) | MUX_PA02A_SCIF_GCLK0)
#define GPIO_PA02A_SCIF_GCLK0    _UL(1 <<  2)
#define PIN_PA20E_SCIF_GCLK1           _L(20) /**< \brief SCIF signal: GCLK1 on PA20 mux E */
#define MUX_PA20E_SCIF_GCLK1            _L(4)
#define PINMUX_PA20E_SCIF_GCLK1    ((PIN_PA20E_SCIF_GCLK1 << 16) | MUX_PA20E_SCIF_GCLK1)
#define GPIO_PA20E_SCIF_GCLK1    _UL(1 << 20)
#define PIN_PB11E_SCIF_GCLK1           _L(43) /**< \brief SCIF signal: GCLK1 on PB11 mux E */
#define MUX_PB11E_SCIF_GCLK1            _L(4)
#define PINMUX_PB11E_SCIF_GCLK1    ((PIN_PB11E_SCIF_GCLK1 << 16) | MUX_PB11E_SCIF_GCLK1)
#define GPIO_PB11E_SCIF_GCLK1    _UL(1 << 11)
#define PIN_PC27E_SCIF_GCLK1           _L(91) /**< \brief SCIF signal: GCLK1 on PC27 mux E */
#define MUX_PC27E_SCIF_GCLK1            _L(4)
#define PINMUX_PC27E_SCIF_GCLK1    ((PIN_PC27E_SCIF_GCLK1 << 16) | MUX_PC27E_SCIF_GCLK1)
#define GPIO_PC27E_SCIF_GCLK1    _UL(1 << 27)
#define PIN_PB12E_SCIF_GCLK2           _L(44) /**< \brief SCIF signal: GCLK2 on PB12 mux E */
#define MUX_PB12E_SCIF_GCLK2            _L(4)
#define PINMUX_PB12E_SCIF_GCLK2    ((PIN_PB12E_SCIF_GCLK2 << 16) | MUX_PB12E_SCIF_GCLK2)
#define GPIO_PB12E_SCIF_GCLK2    _UL(1 << 12)
#define PIN_PC28E_SCIF_GCLK2           _L(92) /**< \brief SCIF signal: GCLK2 on PC28 mux E */
#define MUX_PC28E_SCIF_GCLK2            _L(4)
#define PINMUX_PC28E_SCIF_GCLK2    ((PIN_PC28E_SCIF_GCLK2 << 16) | MUX_PC28E_SCIF_GCLK2)
#define GPIO_PC28E_SCIF_GCLK2    _UL(1 << 28)
#define PIN_PB13E_SCIF_GCLK3           _L(45) /**< \brief SCIF signal: GCLK3 on PB13 mux E */
#define MUX_PB13E_SCIF_GCLK3            _L(4)
#define PINMUX_PB13E_SCIF_GCLK3    ((PIN_PB13E_SCIF_GCLK3 << 16) | MUX_PB13E_SCIF_GCLK3)
#define GPIO_PB13E_SCIF_GCLK3    _UL(1 << 13)
#define PIN_PC29E_SCIF_GCLK3           _L(93) /**< \brief SCIF signal: GCLK3 on PC29 mux E */
#define MUX_PC29E_SCIF_GCLK3            _L(4)
#define PINMUX_PC29E_SCIF_GCLK3    ((PIN_PC29E_SCIF_GCLK3 << 16) | MUX_PC29E_SCIF_GCLK3)
#define GPIO_PC29E_SCIF_GCLK3    _UL(1 << 29)
#define PIN_PA23E_SCIF_GCLK_IN0        _L(23) /**< \brief SCIF signal: GCLK_IN0 on PA23 mux E */
#define MUX_PA23E_SCIF_GCLK_IN0         _L(4)
#define PINMUX_PA23E_SCIF_GCLK_IN0  ((PIN_PA23E_SCIF_GCLK_IN0 << 16) | MUX_PA23E_SCIF_GCLK_IN0)
#define GPIO_PA23E_SCIF_GCLK_IN0  _UL(1 << 23)
#define PIN_PB14E_SCIF_GCLK_IN0        _L(46) /**< \brief SCIF signal: GCLK_IN0 on PB14 mux E */
#define MUX_PB14E_SCIF_GCLK_IN0         _L(4)
#define PINMUX_PB14E_SCIF_GCLK_IN0  ((PIN_PB14E_SCIF_GCLK_IN0 << 16) | MUX_PB14E_SCIF_GCLK_IN0)
#define GPIO_PB14E_SCIF_GCLK_IN0  _UL(1 << 14)
#define PIN_PC30E_SCIF_GCLK_IN0        _L(94) /**< \brief SCIF signal: GCLK_IN0 on PC30 mux E */
#define MUX_PC30E_SCIF_GCLK_IN0         _L(4)
#define PINMUX_PC30E_SCIF_GCLK_IN0  ((PIN_PC30E_SCIF_GCLK_IN0 << 16) | MUX_PC30E_SCIF_GCLK_IN0)
#define GPIO_PC30E_SCIF_GCLK_IN0  _UL(1 << 30)
#define PIN_PA24E_SCIF_GCLK_IN1        _L(24) /**< \brief SCIF signal: GCLK_IN1 on PA24 mux E */
#define MUX_PA24E_SCIF_GCLK_IN1         _L(4)
#define PINMUX_PA24E_SCIF_GCLK_IN1  ((PIN_PA24E_SCIF_GCLK_IN1 << 16) | MUX_PA24E_SCIF_GCLK_IN1)
#define GPIO_PA24E_SCIF_GCLK_IN1  _UL(1 << 24)
#define PIN_PB15E_SCIF_GCLK_IN1        _L(47) /**< \brief SCIF signal: GCLK_IN1 on PB15 mux E */
#define MUX_PB15E_SCIF_GCLK_IN1         _L(4)
#define PINMUX_PB15E_SCIF_GCLK_IN1  ((PIN_PB15E_SCIF_GCLK_IN1 << 16) | MUX_PB15E_SCIF_GCLK_IN1)
#define GPIO_PB15E_SCIF_GCLK_IN1  _UL(1 << 15)
#define PIN_PC31E_SCIF_GCLK_IN1        _L(95) /**< \brief SCIF signal: GCLK_IN1 on PC31 mux E */
#define MUX_PC31E_SCIF_GCLK_IN1         _L(4)
#define PINMUX_PC31E_SCIF_GCLK_IN1  ((PIN_PC31E_SCIF_GCLK_IN1 << 16) | MUX_PC31E_SCIF_GCLK_IN1)
#define GPIO_PC31E_SCIF_GCLK_IN1  _UL(1 << 31)
/* ========== GPIO definition for EIC peripheral ========== */
#define PIN_PB01C_EIC_EXTINT0          _L(33) /**< \brief EIC signal: EXTINT0 on PB01 mux C */
#define MUX_PB01C_EIC_EXTINT0           _L(2)
#define PINMUX_PB01C_EIC_EXTINT0   ((PIN_PB01C_EIC_EXTINT0 << 16) | MUX_PB01C_EIC_EXTINT0)
#define GPIO_PB01C_EIC_EXTINT0   _UL(1 <<  1)
#define PIN_PB01C_EIC_EXTINT_NUM        _L(0) /**< \brief EIC signal: PIN_PB01 External Interrupt Line */
#define PIN_PA06C_EIC_EXTINT1           _L(6) /**< \brief EIC signal: EXTINT1 on PA06 mux C */
#define MUX_PA06C_EIC_EXTINT1           _L(2)
#define PINMUX_PA06C_EIC_EXTINT1   ((PIN_PA06C_EIC_EXTINT1 << 16) | MUX_PA06C_EIC_EXTINT1)
#define GPIO_PA06C_EIC_EXTINT1   _UL(1 <<  6)
#define PIN_PA06C_EIC_EXTINT_NUM        _L(1) /**< \brief EIC signal: PIN_PA06 External Interrupt Line */
#define PIN_PA16C_EIC_EXTINT1          _L(16) /**< \brief EIC signal: EXTINT1 on PA16 mux C */
#define MUX_PA16C_EIC_EXTINT1           _L(2)
#define PINMUX_PA16C_EIC_EXTINT1   ((PIN_PA16C_EIC_EXTINT1 << 16) | MUX_PA16C_EIC_EXTINT1)
#define GPIO_PA16C_EIC_EXTINT1   _UL(1 << 16)
#define PIN_PA16C_EIC_EXTINT_NUM        _L(1) /**< \brief EIC signal: PIN_PA16 External Interrupt Line */
#define PIN_PC24B_EIC_EXTINT1          _L(88) /**< \brief EIC signal: EXTINT1 on PC24 mux B */
#define MUX_PC24B_EIC_EXTINT1           _L(1)
#define PINMUX_PC24B_EIC_EXTINT1   ((PIN_PC24B_EIC_EXTINT1 << 16) | MUX_PC24B_EIC_EXTINT1)
#define GPIO_PC24B_EIC_EXTINT1   _UL(1 << 24)
#define PIN_PC24B_EIC_EXTINT_NUM        _L(1) /**< \brief EIC signal: PIN_PC24 External Interrupt Line */
#define PIN_PA04C_EIC_EXTINT2           _L(4) /**< \brief EIC signal: EXTINT2 on PA04 mux C */
#define MUX_PA04C_EIC_EXTINT2           _L(2)
#define PINMUX_PA04C_EIC_EXTINT2   ((PIN_PA04C_EIC_EXTINT2 << 16) | MUX_PA04C_EIC_EXTINT2)
#define GPIO_PA04C_EIC_EXTINT2   _UL(1 <<  4)
#define PIN_PA04C_EIC_EXTINT_NUM        _L(2) /**< \brief EIC signal: PIN_PA04 External Interrupt Line */
#define PIN_PA17C_EIC_EXTINT2          _L(17) /**< \brief EIC signal: EXTINT2 on PA17 mux C */
#define MUX_PA17C_EIC_EXTINT2           _L(2)
#define PINMUX_PA17C_EIC_EXTINT2   ((PIN_PA17C_EIC_EXTINT2 << 16) | MUX_PA17C_EIC_EXTINT2)
#define GPIO_PA17C_EIC_EXTINT2   _UL(1 << 17)
#define PIN_PA17C_EIC_EXTINT_NUM        _L(2) /**< \brief EIC signal: PIN_PA17 External Interrupt Line */
#define PIN_PC25B_EIC_EXTINT2          _L(89) /**< \brief EIC signal: EXTINT2 on PC25 mux B */
#define MUX_PC25B_EIC_EXTINT2           _L(1)
#define PINMUX_PC25B_EIC_EXTINT2   ((PIN_PC25B_EIC_EXTINT2 << 16) | MUX_PC25B_EIC_EXTINT2)
#define GPIO_PC25B_EIC_EXTINT2   _UL(1 << 25)
#define PIN_PC25B_EIC_EXTINT_NUM        _L(2) /**< \brief EIC signal: PIN_PC25 External Interrupt Line */
#define PIN_PA05C_EIC_EXTINT3           _L(5) /**< \brief EIC signal: EXTINT3 on PA05 mux C */
#define MUX_PA05C_EIC_EXTINT3           _L(2)
#define PINMUX_PA05C_EIC_EXTINT3   ((PIN_PA05C_EIC_EXTINT3 << 16) | MUX_PA05C_EIC_EXTINT3)
#define GPIO_PA05C_EIC_EXTINT3   _UL(1 <<  5)
#define PIN_PA05C_EIC_EXTINT_NUM        _L(3) /**< \brief EIC signal: PIN_PA05 External Interrupt Line */
#define PIN_PA18C_EIC_EXTINT3          _L(18) /**< \brief EIC signal: EXTINT3 on PA18 mux C */
#define MUX_PA18C_EIC_EXTINT3           _L(2)
#define PINMUX_PA18C_EIC_EXTINT3   ((PIN_PA18C_EIC_EXTINT3 << 16) | MUX_PA18C_EIC_EXTINT3)
#define GPIO_PA18C_EIC_EXTINT3   _UL(1 << 18)
#define PIN_PA18C_EIC_EXTINT_NUM        _L(3) /**< \brief EIC signal: PIN_PA18 External Interrupt Line */
#define PIN_PC26B_EIC_EXTINT3          _L(90) /**< \brief EIC signal: EXTINT3 on PC26 mux B */
#define MUX_PC26B_EIC_EXTINT3           _L(1)
#define PINMUX_PC26B_EIC_EXTINT3   ((PIN_PC26B_EIC_EXTINT3 << 16) | MUX_PC26B_EIC_EXTINT3)
#define GPIO_PC26B_EIC_EXTINT3   _UL(1 << 26)
#define PIN_PC26B_EIC_EXTINT_NUM        _L(3) /**< \brief EIC signal: PIN_PC26 External Interrupt Line */
#define PIN_PA07C_EIC_EXTINT4           _L(7) /**< \brief EIC signal: EXTINT4 on PA07 mux C */
#define MUX_PA07C_EIC_EXTINT4           _L(2)
#define PINMUX_PA07C_EIC_EXTINT4   ((PIN_PA07C_EIC_EXTINT4 << 16) | MUX_PA07C_EIC_EXTINT4)
#define GPIO_PA07C_EIC_EXTINT4   _UL(1 <<  7)
#define PIN_PA07C_EIC_EXTINT_NUM        _L(4) /**< \brief EIC signal: PIN_PA07 External Interrupt Line */
#define PIN_PA19C_EIC_EXTINT4          _L(19) /**< \brief EIC signal: EXTINT4 on PA19 mux C */
#define MUX_PA19C_EIC_EXTINT4           _L(2)
#define PINMUX_PA19C_EIC_EXTINT4   ((PIN_PA19C_EIC_EXTINT4 << 16) | MUX_PA19C_EIC_EXTINT4)
#define GPIO_PA19C_EIC_EXTINT4   _UL(1 << 19)
#define PIN_PA19C_EIC_EXTINT_NUM        _L(4) /**< \brief EIC signal: PIN_PA19 External Interrupt Line */
#define PIN_PC27B_EIC_EXTINT4          _L(91) /**< \brief EIC signal: EXTINT4 on PC27 mux B */
#define MUX_PC27B_EIC_EXTINT4           _L(1)
#define PINMUX_PC27B_EIC_EXTINT4   ((PIN_PC27B_EIC_EXTINT4 << 16) | MUX_PC27B_EIC_EXTINT4)
#define GPIO_PC27B_EIC_EXTINT4   _UL(1 << 27)
#define PIN_PC27B_EIC_EXTINT_NUM        _L(4) /**< \brief EIC signal: PIN_PC27 External Interrupt Line */
#define PIN_PA20C_EIC_EXTINT5          _L(20) /**< \brief EIC signal: EXTINT5 on PA20 mux C */
#define MUX_PA20C_EIC_EXTINT5           _L(2)
#define PINMUX_PA20C_EIC_EXTINT5   ((PIN_PA20C_EIC_EXTINT5 << 16) | MUX_PA20C_EIC_EXTINT5)
#define GPIO_PA20C_EIC_EXTINT5   _UL(1 << 20)
#define PIN_PA20C_EIC_EXTINT_NUM        _L(5) /**< \brief EIC signal: PIN_PA20 External Interrupt Line */
#define PIN_PC03B_EIC_EXTINT5          _L(67) /**< \brief EIC signal: EXTINT5 on PC03 mux B */
#define MUX_PC03B_EIC_EXTINT5           _L(1)
#define PINMUX_PC03B_EIC_EXTINT5   ((PIN_PC03B_EIC_EXTINT5 << 16) | MUX_PC03B_EIC_EXTINT5)
#define GPIO_PC03B_EIC_EXTINT5   _UL(1 <<  3)
#define PIN_PC03B_EIC_EXTINT_NUM        _L(5) /**< \brief EIC signal: PIN_PC03 External Interrupt Line */
